Repository: neloduka-sobe/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/editing_animation_levels.po
Languages: es

source: Any trucking, resizing and animation of the camera is not considered when exporting Vector levels.
es: Los cambios en el tamaño, los derivados de los desplazamientos o de la animación de la cámara, no serán considerados al exportar niveles vectoriales.

source: The **Retas Compliant** option can be used to automatically name the exported sequence with a a progressive four-digits number suffix before the file extension (e.g. ``animation0001.tga`` , ``animation0002.tga`` , etc.) and set the exporting format to TGA.
es: Es posible activar la opción **Compatible con Retas** para hacer que automáticamente el nombre de la secuencia incluya un sufijo numérico progresivo de cuatro dígitos, antes de la extensión del archivo (p.ej: ``animación0001.tga`` , ``animación0002.tga`` , etc.) y que el formato de archivo de salida sea TGA.

source: **Background Color** option allows to set the RGBA values of the background color.
es: **Color de fondo:** permite definir los valores de RVA para el color de fondo.

source: The **No Antialias** option allows to remove the antialiasing from the exported sequence.
es: La opción **Sin suavizado de bordes** permite eliminar el suavizado de bordes de la secuencia exportada.

source: **To export the current level:**
es: **Para exportar el nivel actual:**

source: Choose Level → **Export Level...**
es: Elegir Nivel → **Exportar nivel...**

source: In the **File Browser** tab, select the location and name of the level you want to save.
es: En la solapa **Explorador de archivos** seleccionar una ubicación y un nombre base para el archivo.

source: Choose the file format you want the exported level to have.
es: Elegir el formato de archivo en que se desee guardar el nivel exportado.

source: Activate the **Retas Compliant** option to export the level in the same format and with the same options that the Retas software uses, when exporting painted drawings.
es: Si, al exportar dibujos pintados, se desea exportar en el mismo formato y opciones usadas por el programa Retas, activar la opción **Compatible con Retas**.

source: In the **Export Options** tab, set the RGBA values for the background color.
es: En la solapa **Opciones de exportación**, definir los valores RVA para el color de fondo.

source: Activate the **No Antialias** option if you want to remove the anitialias from the exported levels sequence images.
es: Activar la opción **Sin suavizado de bordes** para eliminar el suavizado de bordes de las imágenes exportadas.

source: If you are exporting a Toonz Vector Level:
es: Al exportar un nivel Vectorial de Toonz:

source: Set the output size using the **Vectors Export Box** section options.
es: Definir el tamaño y resolución de salida usando los valores de la sección **Exportación vectorial**.

source: Set **Start** and **End** percentage values for the lines thickness.
es: En la sección **Grosor de trazos**. definir un valor **Inicial:** y **Final:**, si se desea que el grosor de los mismos varíe durante el transcurso del nivel.

source: Click the **Export** button.
es: Hacer clic en el botón **Exportar**.

source: The Export Level command creates a new version of the level with a different file name, location and format, but does not change the name, location and format of the level used in the scene.
es: El comando **Exportar nivel...** creará una nueva versión del nivel seleccionado, con un nombre, ubicación y formato distintos, sin embargo no cambiará el nombre, ubicación y formato del nivel usado en la escena.

source: **To set the file format options:**
es: **Para definir las opciones de formato de archivo:**

source: At the bottom of the window, choose a file **Format** from the dropdown.
es: En la parte inferior de la ventana, elegir un **Formato:** desde el menú desplegable.

source: Press the **Options** button for setting additional options for the format previously chosen.
es: Presionar el botón **Opciones** para definir opciones adicionales del formato previamente elegido.
