Repository: neloduka-sobe/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/editing_animation_levels.po
Languages: es

source: Editing Animation Levels
es: Edición de niveles de animación

source: Once you have created your animation levels, you may need to work on them in order to add or insert new drawings, or rearrange the frame sequence.
es: Una vez se hayan creado niveles de animación, es posible que sea necesario trabajar en ellos para agregar o insertar nuevos dibujos, o reordenar la secuencia de fotogramas.

source: All the editing can be saved by saving the level, or by saving the scene with the Save All command, thus automatically saving all of its levels.
es: Cualquier tipo de edición es almacenada al guardar el nivel o al guardar la escena usando el comando **Guardar todo**, que guarda todos los niveles de la misma.

source: Using the Level Strip
es: Uso de la Cinta de nivel

source: An animation level can be managed in the Level Strip. The Level Strip shows all of the drawings of the current level (even drawings not currently exposed in the Xsheet/Timeline) according to their numbering order.
es: Es posible administrar un nivel de animación usando la Cinta de nivel. En la Cinta de nivel se muestran todos los dibujos del nivel seleccionado (incluso aquellos que no se encuentren expuestos en la Planilla/Línea de tiempo) de acuerdo a su orden numérico.

source: In case a frame range of the animation level has been loaded with the Load Level dialog, only the frames within the allocated frame range will be visible in the level strip (see :ref:`Using the File Browser <using_the_file_browser>` ).
es: En caso de que se haya cargado un rango de fotogramas de un nivel de animación, usando el diálogo **Cargar nivel**, sólo dichos fotogramas serán visibles en la Cinta de nivel (ver :ref:`Uso del Explorador de archivos <using_the_file_browser>` ).

source: When a level is selected, each frame of the strip contains a level drawing, according to the level numbering order. When a frame in the strip is selected, the related drawing is displayed in the Viewer, replacing any previous displayed content, to let you work on it more easily.
es: Cuando un nivel se encuentre seleccionado, cada fotograma de la cinta contendrá un dibujo del mismo, de acuerdo al orden de numeración de dicho nivel. Cuando se seleccione uno de los fotogramas en la cinta, el dibujo correspondiente se mostrará en el Visor, reemplazando cualquier contenido previo, para permitir un trabajo más simple en el mismo.

source: When one or more frames are selected you can perform standard cut, copy, paste, delete and insert operations. New drawings can be added, and any sequence can be renumbered. From the Level Strip, drawings can be also exposed in the Xsheet/Timeline.
es: Cuando uno o más fotogramas se encuentren seleccionados será posible realizar operaciones comunes como cortar, copiar, pegar e insertar. También será posible agregar nuevos dibujos, así como renumerar cualquier secuencia. También es posible exponer dibujos en la Planilla/Línea de tiempo usando la Cinta de nivel.

source: When you change the order of the drawings in the Level Strip, or when a drawing is cut, deleted or inserted, and drawings are exposed in the scene, the Xsheet/Timeline will continue to contain a reference to that particular frame of the animation level, whatever its content is. When the Xsheet/Timeline contains a reference to a drawing that is eliminated in the Level Strip, the level name and number turn red, to warn you that there is no drawing available for that cell anymore.
es: Cuando usando la Cinta de nivel se cambie el orden, corten, borren o inserten dibujos en un nivel ya expuesto en la Planilla/Línea de tiempo, de forma predefinida los dibujos expuestos permanecerán haciendo referencia al número de fotograma original y no al contenido original de los dibujos. Cuando la Planilla/Línea de tiempo contenga una referencia a un dibujo que haya sido eliminado en la Cinta de nivel, el nombre del nivel y su número se mostrarán en rojo, para advertir que ya no existe un dibujo disponible en esa celda.

source: The width of the level strip pane cannot be resized freely, because it depends on the size of the animation level preview icons, but it can be customized in the Preferences... → Interface dialog.
es: Si bien es posible cambiar el ancho del panel Cinta de nivel, el tamaño de las miniaturas no se ajustará interactivamente; sin embargo sí es posible hacer esto desde el diálogo Archivo → Preferencias... → Interfaz.

source: **To edit an animation level in the Level Strip:**
es: **Para editar un nivel de animación en la Cinta de nivel:**

source: Do one of the following:
es: Hacer una de las siguientes cosas:

source: Select in the Xsheet/Timeline a cell containing a drawing from the animation level you want to edit.
es: Seleccionar, en la Planilla/Línea de tiempo, una celda que contenga un dibujo del nivel de animación que se desee editar.

source: Right-click the level icon in the Scene Cast and choose Display in Level Strip from the menu that opens.
es: Hacer clic derecho sobre el ícono del nivel deseado en el panel Componentes de la escena y elegir la opción Mostrar en Cinta de nivel.

source: **To scroll the Level Strip:**
es: **Para desplazar la Cinta de nivel:**

source: Middle-click and drag to scroll up or down.
es: Hacer clic central y arrastrar para desplazar hacia arriba o abajo.

source: Use the mouse wheel to scroll up or down.
es: Usar la rueda del ratón para desplazar hacia arriba o abajo.

source: Use the scrolling bars to scroll only within the actual level extent.
es: Usar las barras de desplazamiento para desplazar.

source: Use the Up Arrow and Down Arrow keys to move one frame up or down.
es: Usar las teclas de flechas hacia arriba y abajo para mover de a un fotograma hacia arriba o abajo.

source: Use the Page Up and Page Down keys to scroll the visible frames up or down.
es: Usar las teclas RePág o AvPág para desplazar los fotogramas visibles hacia arriba o abajo.

source: Use the Home and End keys to scroll up to the beginning or the end of the level strip content.
es: Usar las teclas Inicio y Fin para desplazar hasta el comienzo o el final del contenido de la Cinta de nivel.

source: **To select drawings in the Level Strip:**
es: **Para seleccionar dibujos en la Cinta de nivel:**

source: Click a drawing to select it.
es: Hacer clic sobre un dibujo para seleccionarlo.

source: Click and drag to select a series of drawings.
es: Hacer clic y arrastrar para seleccionar una serie de dibujos.

source: Shift-click a frame to extend the selection up to that frame.
es: Hacer Mayúsculas + clic para extender la selección actual hasta ese fotograma.

source: Ctrl-click (PC) or Cmd-click (Mac) the frames to add them to, or remove them from the selection.
es: Ctrl-clic (PC) o Cmd-clic (macOS) los fotogramas para agregarlos o quitarlos de la selección.

source: Use the Edit → **Select All** command to select all of the level drawings.
es: Usar el comando Editar → **Seleccionar todo** para seleccionar todos los dibujos del nivel.

source: Use the Edit → **Invert Selection** command to invert the current selection of drawings.
es: Usar el comando Editar → **Invertir la selección** para invertir la selección actual de dibujos.

source: The Select All and Invert Selection commands are also available in the menu that opens when right-clicking in the Level Strip.
es: Los comandos **Seleccionar todo** e **Invertir la selección** también se encuentran disponibles en el menú contextual (clic derecho) de la Cinta de nivel.

source: **To exit the Level Strip editing mode:**
es: **Para salir del modo de edición en la Cinta de nivel:**

source: Click a cell or select a frame in the frames area of the Xsheet/Timeline.
es: Hacer clic sobre una celda o seleccionar un fotograma en el área de fotogramas de la Planilla/Línea de tiempo.

source: **To customize the Level Strip thumbnail size:**
es: **Para personalizar el ancho de la Cinta de nivel:**

source: Choose File → Preferences... → Interface.
es: Elegir Archivo → Preferencias... → Interfaz.

source: Set the width and height values of the **Level Strip Thumbnail Size** option.
es: Definir los valores de ancho y altura de la propiedad **Miniaturas en Cinta de nivel**.

source: Restart OpenToonz to make the changes effective.
es: Reiniciar OpenToonz para que los cambios entren en vigor.

source: Editing Level Frames
es: Edición de los fotogramas de un nivel

source: The level content can be edited one frame at a time, for example for retouching some artwork or copying a part of a drawing to a different frame, or several frames at the same time, for example to rearrange the drawing sequence.
es: Es posible editar el contenido de un nivel un fotograma a la vez, por ejemplo para retocar un dibujo o copiar una parte de un dibujo a un fotograma distinto, o varios fotogramas al mismo tiempo, por ejemplo para reordenar la secuencia de dibujos.

source: **To edit a drawing of an animation level:**
es: **Para editar un dibujo de un nivel de animación:**

source: Select the frame in the Level Strip containing the drawing you want to modify.
es: Seleccionar en la Cinta de nivel el fotograma que contiene el dibujo que se desea modificar.

source: Use the tools to edit the drawing in the Viewer.
es: En el Visor, usar las herramientas para editar el dibujo.

source: **To edit drawings of an animation level with the Edit menu commands:**
es: **Para editar dibujos de un nivel de animación usando los comandos del menú Editar:**

source: Select the frames you want to edit.
es: Seleccionar los fotogramas que se desee editar.

source: Do any of the following:
es: Hacer alguna de las siguientes cosas:

source: Use the **Copy** command to keep in memory selected drawings for further operations.
es: Usar el comando **Copiar** para almacenar en memoria los dibujos seleccionados para posteriores operaciones.

source: Use the **Cut** command to eliminate selected drawings from the animation level and keep them in memory for further operations. The frames elimination causes a gap in the level numbering order.
es: Usar el comando **Cortar** para eliminar los dibujos seleccionados del nivel y almacenarlos en memoria para posteriores operaciones. La eliminación de fotogramas causará un salto en el orden de la numeración de los fotogramas del nivel.

source: Use the **Paste** command to paste drawings kept in memory in the animation level, starting from the selected insertion frame. The operation shifts down the following frames, and automatically renumbers them. If before the insertion frame there is a numbering gap, the pasted frames will fill the gap before starting to shift and renumber the following frames.
es: Usar el comando **Pegar (insertar)** para pegar los dibujos almacenados en memoria en el nivel de animación, insertándolos a partir del fotograma seleccionado. La operación desplazará hacia abajo los fotogramas siguientes, y los renumerará automáticamente. Si antes del fotograma seleccionado existiera un salto en la numeración, los fotogramas pegados rellenarán ese hueco antes de comenzar desplazar y renumerar a los fotogramas siguientes.

source: Use the **Paste Into** command to paste drawings kept in memory in the frames selected in the level strip, overwriting their content. If the selection contains less frames than those kept in memory, frames in excess will be ignored; if the selection contains more frames than those kept in memory, frames in excess will be left as they are.
es: Usar el comando **Pegar dentro** para pegar los dibujos almacenados en memoria en los fotogramas seleccionados en la Cinta de nivel, sobrescribiendo su contenido. Si la selección contuviera menos fotogramas que aquellos almacenados en memoria, los fotogramas en memoria sobrantes serán ignorados; si la selección contuviera más fotogramas que aquellos almacenados en memoria, los fotogramas sobrantes de la selección se mantendrán intocados.

source: Use the **Delete** command to delete selected drawings.
es: Usar el comando **Borrar** para borrar los fotogramas seleccionados.

source: Use the **Insert** command to insert empty (white) frames before the selection; inserted frames will be as many as the selected ones. The operation shifts down the following frames, and automatically renumbers them.
es: Usar el comando **Insertar** para insertar fotogramas vacíos antes de los fotogramas seleccionados; los fotogramas a insertar serán tantos como los seleccionados. La operación desplazará hacia abajo los fotogramas siguientes, renumerándolos automáticamente.

source: All of the Edit menu commands are also available in the menu that opens when right-clicking in the Level Strip.
es: Todos los comandos del menú Editar también se encuentran disponibles en el menú contextual (clic derecho) de la Cinta de nivel.

source: **To edit drawings of an animation level with the Cells menu commands:**
es: **Para editar dibujos de un nivel de animación usando los comandos del menú Celdas:**

source: Use the **Reverse** command to invert the order of selected drawings.
es: Usar el comando **Invertir** para invertir el orden de los dibujos seleccionados.

source: Use the **Swing** command to append selected drawings to the end of the selection in a reversed order. The last drawing of the selection will not be repeated.
es: Usar el comando **Oscilar** para anexar los dibujos seleccionados al final de la selección, en orden inverso. El último dibujo de la selección no será repetido.

source: Use the **Step 2**, **Step 3** or **Step 4** command to repeat selected drawings in order to have a step 2, step 3 or step 4 animation.
es: Usar los comandos **Exposición x2**, **Exposición x3** o **Exposición x4** para repetir los dibujos seleccionados de manera de obtener una animación a cuadro doble, triple o cuádruple, en la Cinta de nivel.

source: Use the **Each 2**, **Each 3** or **Each 4**, command to preserve only one drawing each 2, each 3 or each 4, of the selection, and delete the others.
es: Usar los comandos **Uno de cada 2**, **Uno de cada 3**, **Uno de cada 4** para conservar sólo un dibujo de cada 2, 3 o 4 de la selección de la Cinta de nivel, borrando los demás.

source: Use the **Duplicate Drawing** command to make a copy of the *first drawing* of the selection in the following frame. If the following frames already contain drawings, the duplicated drawing will be inserted by shifting the others down in the Xsheet (or right in the Timeline).
es: Usar el comando **Duplicar dibujo** para hacer una copia del primer dibujo de la selección, en el fotograma siguiente. Si los fotogramas siguientes ya contuvieran dibujos, el dibujo duplicado será insertado, desplazándolos hacia abajo en la Planilla (o hacia la derecha en la Línea de tiempo).

source: Use the **Merge** command to paste in the current level the drawings copied from a different level, according to their original frame position and regardless of the currently selected frames.
es: Usar el comando **Fusionar** para pegar, en el nivel actual, dibujos copiados desde otro nivel, de acuerdo a sus posiciones originales de fotograma y sin tomar en cuenta a los fotogramas seleccionados.

source: All of the Cells menu commands are also available in the menu that opens when right-clicking in the Level Strip.
es: Todos los comandos del menú Celdas también se encuentran disponibles en el menú contextual (clic derecho) de la Cinta de nivel.

source: Renumbering and Adding Frames in a Level
es: Renumeración y adición de fotogramas a un nivel

source: When you need to add one or several drawings to a level, you first need to create room for the new drawings. This task can be achieved either using the **Insert** command (see :ref:`Editing Level Frames <editing_level_frames>` ), or the **Renumber...** dialog.
es: Cuando se necesita agregar uno o más dibujos a un nivel, primero se debe crear espacio para los mismos. Esta tarea puede ser realizada mediante el uso del comando **Insertar** (ver :ref:`Edición de los fotogramas de un nivel <editing_level_frames>` ) o del diálogo **Renumerar...**.

source: While the inserting operation automatically shifts the numbering of the following frames in order to make room for the new ones, the renumbering lets you control the way frames have to be renumbered.
es: Mientras la operación de inserción desplaza automáticamente la numeración de los fotogramas siguientes, para hacer espacio para los nuevos, la renumeración permite controlar manualmente la forma en que los fotogramas deberán ser renumerados.

source: After the renumbering, drawings are rearranged to have an incremental numbering in the Level Strip, where blank frames are not considered. For example for a level where frames 4 and 5 are renumbered 11 and 12, the Level Strip will display only five frames correctly numbered 1, 2, 3, 11 and 12.
es: Luego de la renumeración, los dibujos son reordenados para tener una numeración ascendente en la Cinta de nivel, donde no se considerarán los fotogramas en blanco. Por ejemplo, para un nivel compuesto por cinco fotogramas, donde los fotogramas 4 y 5 son renumerados como 11 y 12, la Cinta de nivel seguirá mostrando sólo cinco fotogramas, correctamente renumerados como 1, 2, 3, 11 y 12.

source: If you need to add a range of frames to a level, for instance for scanning them or creating some artwork, you can add it with the Add Frames dialog. This dialog allows you also to insert drawings in a level numbered in an irregular way, for example after some frames which have been cut or renumbered.
es: Si se necesitara agregar un rango de fotogramas a un nivel, por ejemplo para ser escaneados o para dibujar alguna láminas, es posible hacerlo usando el diálogo **Agregar fotogramas**. Este diálogo permite insertar dibujos también en niveles con una numeración irregular, por ejemplo, producto de que algunos fotogramas hubieran sido cortados o renumerados.

source: Both the renumbering and the adding frames operation fails if the numbering assigned to the frames is used by already existing frames.
es: Es posible que tanto la operación de renumeración como la de adición de fotogramas falle, si la numeración asignada a los fotogramas estuviera siendo usada por fotogramas ya existentes.

source: If the **Automatically Create Drawings** option is activated in the Preferences... → Drawing dialog, when you want to add a drawing at the end of the sequence simply select the first grey frame available, and draw in the Viewer.
es: Cuando la opción **Creación automática:** se encuentre habilitada en el diálogo Preferencias... → Dibujo, para agregar un dibujo al final de la secuencia, bastará con seleccionar el primer fotograma siguiente al último y dibujar en el Visor.

source: **To renumber drawings of an animation level:**
es: **Para renumerar dibujos de un nivel de animación:**

source: Select the drawings you want to renumber; also a non-continuous selection is allowed.
es: Seleccionar los dibujos que se deseen renumerar; se permite también una selección discontinua.

source: Select Level → **Renumber...**
es: Seleccionar Nivel → **Renumerar...**

source: In the dialog that opens set the **Start Frame** number that will be assigned to the first drawing of the selection, and the **Step** used to number all following frames in the selection.
es: En el diálogo emergente definir en **Inicio:** el número de fotograma que será asignado al primer dibujo de la selección, y en **Intervalo:** el intervalo a usar para numerar al resto de los fotogramas de la selección.

source: **To add drawings to an animation level:**
es: **Para agregar dibujos a un nivel de animación:**

source: Select Level → **Add Frames...**
es: Seleccionar Nivel → **Agregar fotogramas...**

source: In the dialog that opens sets the frame range you want to add, and the **Step** used to number the frames in the range.
es: En el diálogo emergente definir el rango de fotogramas que se desea agregar, y el **Intervalo:** a usar para numerar a los fotogramas de dicho rango.

source: The Add Frames and Renumber commands are also available in the menu that opens when right-clicking in the Level Strip.
es: Los comandos **Agregar fotogramas...** y **Renumerar...** también se encuentran disponibles en el menú contextual (clic derecho) de la Cinta de nivel.

source: Reverting Level Frames to a Previous Version
es: Revertir fotogramas de un nivel a una versión anterior

source: In case some mistakes are made during the editing of a level, or during the painting process, e.g. a drawing section is accidentally deleted, it is possible to retrieve the last saved version of the level frames.
es: En caso de que se hubiera cometido algún error durante el proceso de edición o pintura de un nivel, p.ej: si una sección de un dibujo hubiera sido accidentalmente borrada, es posible recuperar la última versión guardada de los fotogramas de dicho nivel.

source: For Toonz Raster levels generated from a cleanup process, it is also possible to retrieve the original cleaned up drawings.
es: En el caso de niveles de Imagen de Toonz generados a partir del proceso de limpieza, también es posible recuperar los dibujos originalmente limpiados.

source: In order to revert to the original cleaned up drawings the Preferences... → Drawing → Keep Original Cleaned Up Drawings As Backup option has to be activated when the cleanup is performed (see :ref:`Cleaning up Drawings <cleaning_up_drawings>` ).
es: Para poder revertir a los dibujos originalmente limpiados, es necesario que la opción Archivo → Preferencias... → Dibujo → **Preservar dibujos limpiados intactos como respaldo** se encuentre activada *antes* de realizar el proceso de limpieza (ver :ref:`Limpieza de dibujos <cleaning_up_drawings>` ).

source: **To reload the level drawings to the last saved version:**
es: **Para recargar la última versión guardada de un nivel:**

source: In the Level Strip select the drawings you want to reload.
es: En la Cinta de nivel seleccionar los dibujos que se desee recargar.

source: Choose Level → **Reload**.
es: Elegir Nivel → **Recargar**

source: Right click the selection and choose **Reload** from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir Reemplazar nivel → **Recargar** en el menú.

source: **To revert to the original cleaned up drawings:**
es: **Para revertir a los dibujos originales limpiados:**

source: In the Level Strip select the drawings you want to revert.
es: En la Cinta de nivel seleccionar los dibujos que se desee recargar.

source: Choose Level → **Revert to Cleaned Up**.
es: Elegir Nivel → **Revertir a versión limpia**.

source: Right click the selection and choose **Revert to Cleaned Up** from the menu that opens.
es: Hacer clic derecho sobre la selección y elegir Reemplazar nivel → **Revertir a versión limpia** en el menú.

source: Merging Animation Levels
es: Fusión de niveles de animación

source: Toonz Vector levels and standard Raster levels can be easily merged into a single animation level generated by flattening them according to their stacking order, using the Xsheet → **Merge Levels** command. Toonz Raster levels can be merged using the Xsheet → **Merge TLV Levels** command.
es: Es posible fusionar varios niveles (tanto de tipo Vectorial de Toonz como de Imagen estándar) en uno solo, generado tomando en cuenta su orden en la Planilla/Línea de tiempo, mediante el uso del comando Planilla → **Fusionar niveles**. También es posible fusionar varios niveles de Imagen de Toonz (TLV), usando el comando Planilla → **Fusionar niveles TLV...**.
