Repository: neloduka-sobe/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/editing_animation_levels.po
Languages: es

source: This can be useful for instance if you are sketching an animation with drawings repeated in several cells and exposed in several columns, and you want to generate a single sequence of drawings.
es: Esto puede ser útil, por ejemplo, cuando se esté bocetando una animación que use dibujos expuestos a lo largo de varias celdas en varias columnas de la Planilla (o capas de la Línea de tiempo), y se desee generar una única secuencia de dibujos.

source: In both cases there is no limit to the number of columns/layers you can merge.
es: En ambos casos, no existe un límite para el número de columnas/capas a ser fusionadas.

source: Merging Toonz Vector Levels or Raster Levels
es: Fusión de niveles Vectorial de Toonz o de Imagen

source: Using the Xsheet → **Merge Levels** command the number of resulting drawings will depend on the number of drawings exposed in the first Xsheet column on the left of the selection (or in the first Timeline layer on the bottom of the selection). When merging Raster levels, the resolution of the resulting drawings will depend on the resolution of the drawings exposed in the first Xsheet column on the left of the selection (or in the bottom Timeline layer on the bottom of the selection).
es: Al usar el comando Planilla → **Fusionar niveles** la cantidad de dibujos resultantes dependerá de la cantidad de dibujos expuestos en la columna/capa seleccionada de más a la izquierda/abajo. Al fusionar niveles de Imagen estándar, la resolución de los dibujos resultantes dependerá de la resolución de los dibujos expuestos en la columna/capa seleccionada de más a la izquierda/abajo.

source: Animation levels are merged according to the following guidelines:
es: Los niveles de animación son fusionados de acuerdo a las siguientes guías:

source: The frame numbering order is followed; this means that all the drawings exposed at frame 1 will be merged to the drawing exposed at frame 1 of the first column/layer of the selection.
es: Se seguirá el orden de numeración de los fotogramas; esto significa que todos los dibujos expuestos en el fotograma 1 serán fusionados en el dibujo expuesto en el fotograma 1 de la primera columna/capa de la selección.

source: If two different drawings are associated at different frames to the same drawing exposed in the first column/layer of the selection, only the first one will be applied.
es: Si dos dibujos distintos se encuentran asociados, en diferentes fotogramas, al mismo dibujo expuesto en la primera columna/capa de la selección, sólo el primero de ellos será aplicado.

source: Drawings not corresponding to any drawing exposed in the first column/layer of the selection will be ignored.
es: Los dibujos que no se correspondan con ningún dibujo expuesto en la primera columna/capa de la selección serán ignorados.

source: It is not possible to merge columns/layers if *more than one* level is exposed in any of them.
es: No será posible fusionar columnas/capas cuando haya *más de un nivel* expuesto en alguna de ellas.

source: When levels are merged, any geometrical transformation achieved by editing and moving the related column or pegbar, will be retained.
es: Cuando se fusionan niveles, cualquier transformación geométrica lograda mediante la edición y el movimiento de las correspondientes columnas/capas o barras de sujeción, será preservada.

source: For Toonz Vector levels each drawing of the merged levels will be retained as a *group* of vectors in the resulting level; the palette of the resulting level will contain all of the styles used in the drawings of the merged levels.
es: En niveles de tipo Vectorial de Toonz, cada dibujo de los niveles fusionados será mantenido como un *grupo independiente*, en los dibujos del nivel resultante; la paleta del nivel resultante contendrá todos los estilos usados en los dibujos de los niveles fusionados.

source: **To merge animation levels:**
es: **Para fusionar niveles de animación:**

source: Select the columns/layers where the animation levels you want to merge are exposed.
es: Seleccionar las columnas/capas donde se encuentren expuestos los niveles de animación que se desee fusionar.

source: Choose Xsheet → **Merge Levels**.
es: Elegir Planilla → **Fusionar niveles**.

source: Merging Toonz Raster Levels
es: Fusión de niveles de Imagen de Toonz

source: The Xsheet → **Merge TLV Levels** allows to combine several columns containing Toonz Raster Levels creating a new TLV level. The merged columns will be eliminated from the Xsheet/Timeline and replaced with a new TLV level.
es: El comando Planilla → **Fusionar niveles TLV...** permite combinar varias columnas/capas conteniendo niveles de tipo Imagen de Toonz para crear un nuevo nivel TLV. Las columnas/capas fusionadas serán eliminadas de la Planilla/Línea de tiempo y reemplazadas con el nuevo nivel TLV creado.

source: Using the Xsheet → Merge TLV Levels command the number of resulting drawings will depend on the frames combination of the involved levels. When merging Toonz Raster levels, the resolution of the resulting level will depend on the resolution of the drawings exposed in the first Xsheet column on the left of the selection (or in the first Timeline layer on the bottom of the selection).
es: Al usar el comando Planilla → **Fusionar niveles TLV...** la cantidad de dibujos resultantes dependerá de la combinación de los fotogramas de los niveles involucrados. Al fusionar niveles de Imagen de Toonz, la resolución del nivel resultante dependerá de la resolución de los dibujos expuestos en la columna/capa seleccionada de más a la izquierda/abajo.

source: The frame numbering order is followed; this means that the merged level will be created following the frames numbering.
es: Durante la fusión se seguirá el orden de los fotogramas expuestos en la Planilla/Línea de tiempo; esto significa que el nivel fusionado será creado siguiendo la numeración de los mismos.

source: If a combination of drawings will be reused, the drawing previously created will be reused.
es: Si una combinación de fotogramas se repitiera, el dibujo fusionado creado previamente se reutilizará.

source: Also, the palettes of the selected levels will be merged.
es: También serán fusionadas las paletas de los niveles seleccionados.

source: **It is not possible to merge columns/layers if more than one level is exposed in any of them.**
es: **No será posible fusionar columnas/capas cuando hubiera más de un nivel expuesto en cualquiera de ellas.**

source: **To merge Toonz Raster (TLV) levels:**
es: **Para fusionar niveles de Imagen de Toonz (TLV):**

source: Select two ore more columns/layers where the levels you want to merge are exposed.
es: Seleccionar dos o más columnas/capas donde se encuentren expuestos los niveles de animación que se desee fusionar.

source: Choose Xsheet → **Merge TLV Levels**
es: Elegir Planilla → **Fusionar niveles TLV...**

source: Define the **File Name** and **Save in** location in the pop up that opens and press **Apply**.
es: Definir la ubicación y el nombre del nuevo archivo a ser creado, usando el diálogo emergente, y luego presionar **Aplicar**.

source: Processing Levels
es: Manipulación de niveles

source: Some commands are available to process Raster level images in order to adjust their brightness and contrast, to fade their colors toward a defined set of Red, Green, Blue and Alpha values, to adjust their levels or to binarize them. The **Adjust Thickness** command is available to modify the thickness of the lines in Toonz Vector Levels only.
es: Existen algunos comandos capaces de procesar niveles de Imagen, para ajustar su brillo y contraste, fundir hacia un determinado color, ajustar sus niveles, para binarizarlos o agregar suavizado a sus bordes. En niveles Vectorial de Toonz, se encuentra disponible el comando **Ajustar grosor** para modificar el grosor de sus trazos.

source: A preview area is available to check the result of the applied processing: you can navigate its content and set its size.
es: En los diálogos emergentes, se encuentra disponible un área de previsualización para comprobar el resultado del proceso antes de ser aplicado; es posible desplazar y cambiar el zoom de esta vista.

source: The processed images are stored in the cache and will be saved on disk by using the **Save Level**, **Save All Levels**, or **Save All** commands.
es: Las imágenes procesadas son almacenadas en memoria y serán guardadas en disco al usar los comandos **Guardar nivel**, **Guardar todos los niveles** o **Guardar todo**.

source: **To resize the preview area:**
es: **Para redimensionar el área de previsualización:**

source: Click and drag the horizontal separator.
es: Hacer clic y arrastrar el separador horizontal.

source: Click and drag the separator toward the window border to hide the preview area.
es: Hacer clic y arrastrar el separador hacia el extremo inferior de la ventana para ocultar el área de previsualización.

source: Click and drag the separator collapsed to the window border toward the window center to display again the preview area.
es: Hacer clic y arrastrar el separador colapsado en la parte inferior de la ventana hacia arriba para volver a mostrar el área de previsualización.

source: **To navigate the preview area:**
es: **Para navegar el área de previsualización:**

source: Use the mouse wheel, or the zoom shortcut keys (by default + and - keys) to zoom in and zoom out.
es: Es posible usar la rueda del ratón o los atajos de teclado (de forma predefinida **+** y **-**) para controlar el zoom del área de previsualización.

source: Middle-click and drag to scroll in any direction.
es: Hacer clic central y arrastrar para desplazar en cualquier dirección.

source: Use the reset view shortcut (by default the 0 key) to display preview at its actual size.
es: Es posible usar la función **Restablecer vista** para volver la previsualización a su tamaño real, disponible haciendo clic derecho sobre el área de previsualización.

source: Brightness and Contrast
es: Brillo y contraste

source: In case it is needed to adjust drawings in order to increase the darkness and the opacity of the drawing, it is possible to process them by calibrating the brightness and contrast.This is available only for raster levels.
es: En caso de que fuera necesario ajustar un dibujo para oscurecerlo o aumentar su opacidad, será posible procesarlo mediante la calibración de su brillo y contraste. Esto se encuentra disponible sólo para niveles de Imagen.

source: **To process drawings brightness and contrast:**
es: **Para procesar el brillo y contraste de dibujos:**

source: Select the level frames to process in the Xsheet/Timeline or the Level Strip.
es: Seleccionar, en la Planilla/Línea de tiempo o la Cinta de nivel, los dibujos a ser procesados.

source: Choose Level → Adjust → **Brightness and Contrast...**
es: Elegir Nivel → Ajustes → **Brillo y contraste...**.

source: In the dialog that opens set the brightness and contrast variation.
es: En el diálogo emergente definir la variación del brillo y el contraste a aplicar.

source: Click the **Apply** button.
es: Hacer clic en el botón **Aplicar**.

source: Antialias
es: Aplicar suavizado de bordes

source: Allows to add antialias or to make it smoother or harder on Raster and Toonz Raster levels.
es: Permite aplicar un suavizado de bordes o hacerlo más suave o definido, en niveles de Imagen o de Imagen de Toonz.

source: **To use the Antialias command:**
es: **Para usar el comando Aplicar suavizado de bordes:**

source: Choose Level → Adjust → **Antialias...**
es: Elegir Nivel → Ajustes → **Aplicar suavizado de bordes...**

source: In the dialog that opens set the **Threshold** and **Softness** values.
es: En el diálogo emergente definir los valores **Umbral:** y **Suavizado:**.

source: Adjust Levels
es: Ajustar niveles

source: Adjusts the highlights and shadows of the Source content by remapping pixels intensity according to the Input and Output levels values for the RGB, Red, Green, Blue and Alpha channels.
es: Permite ajustar las áreas iluminadas y en sombras del contenido original, remapeando la intensidad de sus píxeles de acuerdo a los valores de sus niveles de Entrada y Salida, para los canales RVA, Rojo, Verde, Azul y Alfa.

source: **To adjust images levels:**
es: **Para ajustar los niveles de una imagen:**

source: Select the level frames to adjust in the Xsheet/Timeline or the Level Strip.
es: Seleccionar, en la Planilla/Línea de tiempo o la Cinta de nivel, los dibujos a ser procesados.

source: Choose Level → Adjust → **Adjust Levels...**
es: Elegir Nivel → Ajustes → **Ajustar niveles...**

source: Adjust the image levels
es: Ajustar los niveles de la imagen.

source: Adjust Thickness
es: Ajustar grosor

source: The Adjust Thickness command allows to modify the thickness of the selected lines in the level. If no line is selected the command acts on the whole level, otherwise it works only on selected lines.
es: El comando **Ajustar grosor** permite modificar el grosor de los trazos seleccionados de un dibujo vectorial. Cuando no hubiera ningún trazo seleccionado, el comando actuará sobre todos los del nivel, en caso contrario actuará únicamente sobre aquellos seleccionados.

source: **To adjust the thickness of the lines:**
es: **Para ajustar el grosor de las líneas:**

source: Choose Level → Adjust → **Adjust Thickness...**
es: Elegir Nivel → Ajustes → **Ajustar grosor...**

source: Choose a mode. The modes are: **Scale Thickness** that scale lines up or down using a percentage value, **Add Thickness** that add an amount of thickness to the lines using the current unit, **Costant Thickness** that apply a thickness value, ignoring its variations, using the current unit.
es: Elegir un **Modo** de entre: **Escalar grosor** que cambia el grosor de los trazos usando un valor porcentual, **Agregar grosor** que suma al grosor de los trazos un valor (expresado en las unidades activas), y **Grosor constante** que aplica a los trazos un valor uniforme (expresado en las unidades activas) e ignorando las variaciones existentes en su grosor.

source: Set **Start** and **End** values.
es: Definir sus valores **Inicial:** y **Final:**, usados en caso de estar aplicando el comando a una secuencia de dibujos de un nivel.

source: Press the **Apply** button.
es: Presionar el botón **Aplicar**.

source: Color Fade
es: Fundir a un color

source: In case it is needed to adjust the drawing colors it is possible to fade the drawings toward a color defined by Red, Green, Blue and Alpha values. The Intensity, expressed as a percentage, ranges from 0 to 100.The original color will fade to the color you set according with the Intensity parameter. This is available only for Raster levels.
es: En caso de necesitar ajustar los colores de un dibujo, es posible fundirlos hacia un color, definido mediante sus valores Rojo, Verde, Azul y Alfa. La **Intensidad:**, expresada como un porcentaje, puede ir de 0 a 100. El color original se fundirá al color especificado de acuerdo al parámetro **Intensidad:**. El comando se encuentra disponible únicamente para niveles de Imagen.

source: **To fade drawing colors:**
es: **Para fundir los colores de un dibujo:**

source: Select the level frames to fade in the Xsheet/Timeline or the Level Strip.
es: Seleccionar, en la Planilla/Línea de tiempo o la Cinta de nivel, los dibujos a ser procesados.

source: Choose Level → Adjust → **Color Fade...**
es: Elegir Nivel → Ajustes → **Fundir a un color...**

source: In the dialog that opens set the color you want to fade the selection to, by doing one of the following:
es: En el diálogo emergente definir el color al cual se desee fundir la selección, haciendo una de las siguientes cosas:

source: Set the **Red**, **Green**, **Blue** and **Alpha** values.
es: Definir los valores de **Rojo**, **Verde**, **Azul** y **Alfa**.

source: Click the color thumbnails and use the Style Editor to edit them (see :ref:`Editing Styles <editing_styles>` ).
es: Hacer clic en la miniatura de color y usar el Editor de estilos para definirlo (ver :ref:`Edición de estilos <editing_styles>` ).

source: Move the intensity sliders to set the color values.
es: Mover el deslizador de **Intensidad:** para definir su valor.

source: Binarize
es: Binarizar

source: Allows you to process images with colored Raster lines, recognizing basic colors (red, green, blue, cyan, magenta and yellow) plus black. The process will produce an uniform background color, eliminating shadows and dirty pixels.
es: Permite procesar líneas de color en niveles de tipo Imagen, siendo capaz de reconocer los colores básicos (rojo, verde, azul, cian, magenta y amarillo), además del negro. El proceso producirá un color de fondo uniforme, eliminando sombras y píxeles sucios.

source: The colored lines are identified and all the pixels belonging to each line are changed to the maximum value of the identified color. Anti-aliasing is removed.
es: Cuando las líneas de color son identificadas, todos los píxeles pertenecientes a cada una de ellas serán cambiados al valor máximo del color identificado. El suavizado de bordes será eliminado.

source: The use of this command is useful to pre-process scanned images, in order to simplify the Cleanup process.
es: Este comando es útil para pre-procesar imágenes escaneadas, simplificando su proceso de Limpieza.

source: The preview is available to check the result. The **Alpha** toggle allows to produce images with a transparent background.
es: La opción **Alfa** permite producir imágenes con un fondo transparente. La opción **Previsualizar** sirve para comprobar el resultado antes de aplicar el comando.

source: **To binarize images:**
es: **Para binarizar imágenes:**

source: Choose Level → Adjust → **Binarize...**
es: Elegir Nivel → Ajustes → **Binarizar...**

source: Activate the **Preview** toggle to check the result.
es: Activar la opción **Previsualizar** para comprobar el resultado.

source: Activate the **Alpha** toggle if you need transparent background.
es: Activar la opción **Alfa** si se necesita obtener un fondo transparente.

source: Saving Levels
es: Guardado de niveles

source: All the editing performed in the Level Strip is not saved until you manually save the level. You can also automatically save all of the editing done on any level of the Xsheet/Timeline by saving the scene using the **Save All** command (see :ref:`Saving and Loading Scenes <saving_and_loading_scenes>` ).
es: Todas las ediciones realizadas en la Cinta de nivel permanecen en memoria hasta que el nivel es guardado. También es posible guardar todas las ediciones realizadas a cualquier nivel de la escena, al usar el comando **Guardar todo** (ver :ref:`Guardado y carga de escenas <saving_and_loading_scenes>` ).

source: When saving an animation level it is possible to automatically create a backup file of the previous version by setting the **Backup Scene and Animation Levels when Saving** option in the Preferences... → Saving dialog section. The backup version will be created in the same location where the level is saved, and will have an **_backup** suffix.
es: Al guardar un nivel de animación es posible crear un respaldo de la versión anterior del mismo de forma automática, al activar la opción **Respaldar escena y niveles de animación al guardar** en el diálogo Archivo → Preferencias... → Guardado. El respaldo es creado en la misma ubicación en que se guardó el nivel, usando el sufijo *_backup*.

source: An asterisk after the level name in the Level Strip title bar denotes that there are unsaved changes for the current level.
es: Un asterisco luego del nombre de un nivel, en la Cinta de nivel, denota que existen cambios no guardados en el mismo.

source: **To save the current level:**
es: **Para guardar el nivel actual:**

source: Choose Level → **Save Level**.
es: Elegir Nivel → **Guardar nivel**.

source: Right-click in the Scene Cast and choose **Save Level** from the menu that opens.
es: Hacer clic derecho en el panel Componentes de la escena y elegir **Guardar nivel** en el menú.

source: **To save the current level with a different name in a different location:**
es: **Para guardar el nivel actual con otro nombre y en una ubicación diferente:**

source: Choose Level → **Save Level As...**
es: Elegir Nivel → **Guardar nivel como...**

source: In the file browser that opens select a location and name for the level you want to save, and click the **Save** button.
es: En el Explorador de archivos emergente seleccionar una ubicación y un nombre para el nivel que se desea guardar y luego hacer clic en el botón **Guardar**.

source: The **Save Level As...** command creates a copy of the level with a different file name and location, but *does not* change the name and location of the level used in the scene.
es: El comando **Guardar nivel como...** crea una copia del nivel con un nombre de archivo y ubicación distintos, sin embargo no cambia el nombre y ubicación del nivel usado en la escena.

source: Exporting Levels
es: Exportación de niveles

source: Animation levels created with OpenToonz can be exported in a variety of image file formats, in order to be used in third-party software. The levels are exported as a sequence of files named with a progressive four-digits number written between the file name and the file extension, e.g. ``animation.0001.tif`` , ``animation.0002.tif`` , etc. or a single file in case of the .TLV format. File formats available are BMP, JPG, PNG, TGA ,TIF and TLV (the .TLV format is available only to export vector levels (.PLI); aditional options for the chosen format can be set in the same way as to when using the Render → Output Settings... dialog (see :ref:`Choosing the Output Settings <choosing_the_output_settings>` ).
es: Es posible exportar niveles de animación creados en OpenToonz en una variedad de formatos de archivo, para poder ser usados en otros programas. Los niveles de Imagen son exportados como una secuencia de archivos, con una numeración progresiva de cuatro dígitos entre el nombre base del archivo y su extensión (p.ej: ``animación.0001.tif`` , ``animación.0002.tif`` , etc.), y los niveles de Imagen de Toonz como un único archivo .TLV. Los formatos de archivo soportados son BMP, JPG, PNG, TGA ,TIF y TLV (el formato .TLV se encuentra disponible sólo cuando se exportan niveles vectoriales de Toonz (.PLI)); es posible definir las opciones para cada formato mediante el botón **Opciones**, que abre un diálogo con las opciones del formato elegido, de forma similar a cuando se usa el diálogo Procesamiento → Opciones de salida... (ver :ref:`Elección de opciones de salida <choosing_the_output_settings>` ).

source: When exporting Vector levels, the size and resolution of the exported sequence can be defined in the **Export Level...** dialog. The default size and resolution are those defined in the Camera Settings window, and the preview of the resulting image is visible in the preview area of the **Export Options** tab, to understand how the exported images will be cropped (see :ref:`Defining Camera Settings <defining_camera_settings>` ). The size of the exported image can be changed by entering a scale value in the **Scale** field.
es: Al exportar niveles vectoriales es posible definir el tamaño y la resolución de la secuencia exportada, usando el diálogo **Exportar nivel...**. El tamaño y resolución predefinidos son aquellos establecidos en las Opciones de cámara y la previsualización de la imagen resultante es visible en el área de previsualización de la solapa **Opciones de exportación**, para permitir entender la forma en que las imágenes exportadas serán recortadas (ver :ref:`Definición de opciones de cámara <defining_camera_settings>` ). Es posible cambiar el tamaño de las imágenes exportadas ingresando un valor en el parámetro **Escala:**
