Repository: neloduka-sobe/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/painting_animation_levels.po
Languages: es

source: **Mode:** has the option **Endpoint to Endpoint**, to join two lines endpoints; **Endpoint to Line**, to join an endpoint to any point along a line; and **Line to Line**, to join any point along a line to any other point along another line.
es: **Modo:** contiene las opciones: **Extremo a extremo** para unir los extremos de dos líneas; **Extremo a línea** para unir un extremo a cualquier punto a lo largo de una línea; **Línea a línea** para unir cualquier punto a lo largo de una línea a cualquier otro punto de otra línea.

source: **Distance** sets the maximum distance between endpoints, and between an endpoint and a line, that are automatically joined when using the Rectangular option.
es: **Distancia** define la distancia máxima entre los extremos, así como entre un extremo y una línea, que se pretende unir automáticamente usando la opción Rectangular.

source: **Join Vectors**, when activated, connects the join stroke to the endpoint thus creating a single stroke; if deactivated the join stroke will be a new independent stroke (see :ref:`Joining and Splitting <joining_and_splitting>` ).
es: **Unir vectores**, al estar activado conectará el trazo de unión a los extremos, creando un trazo único; si se encuentra desactivado el trazo de unión creado se mantendrá como un trazo independiente (ver :ref:`Unión y división <joining_and_splitting>` ).

source: If the strokes you are going to join have different styles, the style of the first stroke you click on will be assigned to the second one, after the joining.
es: Si los trazos que se desea unir contuvieran diferentes estilos, el estilo del primer trazo en el que se hace clic será asignado al segundo, luego de la unión.

source: **Smooth**, when activated, creates a smooth joined stroke with no corners.
es: **Suavizar**, al estar activado, crea un trazo de unión suave, carente de esquinas.

source: For Toonz Raster drawings the **Tape** tool (|tape|) automatically joins the open ends detected in the drawing according to the tool settings. Options available are the following:
es: En niveles de Imagen de Toonz la herramienta **Cinta** (|tape|) permite unir automáticamente los extremos abiertos detectados en el dibujo, según las opciones escogidas. Las opciones disponibles son las siguientes:

source: **Type:** has the options **Normal**, to close all the gaps detected in the drawing by clicking in it; **Rectangular**, to close all the gaps detected in the box you define; **Freehand**, to close on all the gaps detected in the area you define by clicking and dragging; and **Polyline**, to close on all the gaps detected in the area you define by drawing a series of straight lines.
es: **Tipo:** contiene las opciones **Normal** para cerrar todos los huecos detectados en el dibujo al hacer clic sobre el mismo; **Rectangular** para cerrar todos los huecos detectados en el marco rectangular definido; **Lazo** para cerrar todos los huecos detectados en la región definida a mano alzada; y **Línea poligonal** para cerrar todos los huecos detectados en la región definida por una serie de segmentos de recta.

source: **Frame Range** allows you to perform the joining on a range of frames, by clicking in the first and then in the last frame of the range.
es: **Rango de fotogramas** permite aplicar la operación de unión a un rango de fotogramas, haciendo clic en el primer fotograma del rango y luego en el último.

source: **Distance** sets the maximum distance between two open ends to be detected, in order to join them.
es: **Distancia** permite definir la distancia máxima entre dos extremos abiertos para que puedan ser detectados, de forma de ser unidos.

source: **Angle** sets the maximum angle between two open ends to be detected, in order to join them.
es: **Ángulo** permite definir el ángulo entre dos extremos abiertos para que puedan ser detectados, de forma de ser unidos.

source: **Style Index** sets the style to be used for the line joining the open ends. If instead of a style index you type ``current`` , the currentntly selected style will be used.
es: **Índice del estilo** permite definir el estilo a ser usado para la línea que unirá los extremos abiertos. Si en lugar de el número de un estilo se ingresa la palabra ``actual`` , se utilizará el estilo actualmente seleccionado.

source: **Opacity** sets the opacity of the style used for the line joining the open ends.
es: **Opacidad** permite definir la opacidad del estilo usado para la línea que unirá los extremos abiertos.

source: Please note that by default **Opacity** value is set to 1, and with this value the gap will be closed using a transparent line that will not be seen in the Viewer. Also, note that the value of this option will equally affect how the Gap Check function is displayed in the Viewer.
es: Nótese que de forma predefinida el valor de **Opacidad** es 1, y que con ese valor los huecos serán cerrados usando una línea transparente, que no podrá ser apreciada en el Visor. También deberá notarse que el valor de esta opción afectará de igual manera a la forma en que se visualiza la función Comprobación de huecos en el Visor.

source: **To close a gap in a vector drawing outline:**
es: **Para cerrar un hueco en el contorno de un dibujo vectorial:**

source: Select the **Tape** tool (|tape|), set the type to **Normal** and set whether to join vectors, or to create a smooth joining.
es: Seleccionar la herramienta **Cinta** (|tape|), definir el Tipo en **Normal** y decidir si se desea **Unir vectores** y **Suavizar** la unión entre ellos.

source: Set the mode to **Endpoint to Endpoint**, then click a stroke endpoint and drag to a different endpoint; the pointer snaps to the closest detected stroke endpoint, as start and end.
es: Definir el Modo en **Extremo a extremo**, luego hacer clic sobre el extremo de un trazo y arrastrar hasta otro extremo; el puntero se adherirá al extremo del trazo más cercano detectado.

source: Set the mode to **Endpoint to Line**, then click a stroke endpoint and drag to any point along a stroke; the pointer snaps to the closest detected stroke endpoint as start, and to any closest point along a stroke as end.
es: Definir el Modo en **Extremo a línea**, luego hacer clic sobre el extremo de un trazo y arrastrar hasta otro punto a lo largo de un trazo; el puntero se adherirá a cualquier punto del trazo más cercano detectado.

source: Set the mode to **Line to Line**, then click any point along a stroke and drag to any other point along a stroke; the pointer snaps to the closest point along a stroke as start, and to the any other closest point along a stroke as end.
es: Definir el Modo en **Línea a línea**, luego hacer clic sobre cualquier punto a lo largo de un trazo y arrastrar hasta otro punto a lo largo de otro trazo; el puntero se adherirá a cualquier punto del trazo más cercano detectado.

source: **To close all gaps in a vector drawing outline in a specific area:**
es: **Para cerrar todos los huecos del contorno de un dibujo vectorial en un área específica:**

source: Select the **Tape** tool (|tape|), set the type to **Rectangular**.
es: Seleccionar la herramienta **Cinta** (|tape|), definir el Tipo en **Rectangular**.

source: Click and drag to define an area: all the gaps between endpoints, and between endpoints and lines, detected in the area according to the set distance will be closed.
es: Hacer clic y arrastrar para definir una región: todos los huecos entre extremos, así como entre extremos y líneas, detectados en la región, de acuerdo a la **Distancia:** establecida, serán cerrados.

source: **To close all gaps in a raster drawing outline:**
es: **Para cerrar todos los huecos en el contorno de un dibujo de Imagen de Toonz:**

source: Select the **Tape** tool (|tape|).
es: Seleccionar la herramienta **Cinta** (|tape|).

source: Click in the viewer to close all the gaps detected according to the set distance and angle.
es: Hacer clic en el Visor para cerrar todos los huecos detectados, de acuerdo a la **Distancia:* y **Ángulo:** definidos.

source: **To close a specific gap in a raster drawing outline:**
es: **Para cerrar un hueco específico en el contorno de un dibujo de Imagen de Toonz:**

source: Select the **Tape** tool (|tape|) and activate the **Rectangular** option.
es: Seleccionar la herramienta **Cinta** (|tape|) y activar el Tipo **Rectangular**.

source: Click and drag to define an area: all the gaps detected in the area according to the set distance and angle will be closed.
es: Hacer clic y arrastrar para definir una región: todos los huecos detectados en el área, de acuerdo a la **Distancia:** y **Ángulo:** definidos, serán cerrados.

source: Checking Gaps in the Drawing Outline
es: Comprobación de huecos en contornos de dibujos

source: To control the drawing outline and see if areas are well-defined in order to be filled with colors, it is possible to activate a series of checks:
es: Para controlar el contorno de un dibujo y poder visualizar si las áreas se encuentran bien definidas como para poder ser rellenadas con colores, es posible activar una serie de comprobaciones:

source: The **Gap Check** highlights with *magenta lines* the gaps that can be automatically closed by using the **Tape** tool (|tape|) with its current settings; if you change the **Distance** and **Angle** values of the Tape tool, while the check is activated, you can check interactively if the gaps that are detected.
es: **Comprobación de huecos** resalta con *líneas magenta* los huecos que será posible cerrar al usar la herramienta **Cinta** (|tape|) con sus opciones actuales; es posible cambiar el valor de las opciones **Distancia** y **Ángulo** mientras la comprobación se encuentra activa, para comprobar interactivamente qué huecos serán detectados.

source: Please note that the **Tape** tool **Opacity** value will affect the display of the Gap Check in Toonz Raster levels, so if it is set to the default value of 1, you will not be able to see anything with the Gap Check function. Set it to 255 instead, to be able to use this check.
es: Nótese que el valor de la opción **Opacidad**, de la herramienta **Cinta**, afectará la forma en que se muestran los huecos con la herramienta Comprobación de huecos, en niveles de Imagen de Toonz. Usar un valor de 255 para poder usar la comprobación de forma más cómoda.

source: The **Fill Check** displays all the well-defined areas that can be filled with colors in grey, all the lines or vector strokes in black, and the not well-defined areas and the background in white; if the **Black BG Check** is activated, all the lines or vector strokes are displayed in white (see :ref:`Checking Painted Drawings <checking_painted_drawings>` ).
es: **Comprobación de áreas rellenables** permite visualizar en *gris* las áreas correctamente definidas, que podrán ser rellenadas con colores, todas las líneas o trazos vectoriales aparecerán en *negro*, y las áreas incorrectamente definidas, así como el fondo, se mostrarán en *blanco*; si la opción **Ver con fondo negro** estuviera activada, todas las líneas o trazos vectoriales serán mostrados en *blanco* y el fondo en *negro* (ver :ref:`Comprobación de pintura en dibujos <checking_painted_drawings>` ).

source: All the checks can also be combined in order to achieve specific display modes (see also :ref:`Checking Painted Drawings <checking_painted_drawings>` ).
es: También es posible combinar todas las comprobaciones apropiadas con el fin de lograr un modo específico de visualización que resulte de utilidad (ver también :ref:`Comprobación de pintura en dibujos <checking_painted_drawings>` ).

source: **To check if gaps occur in the drawing outline:**
es: **Para comprobar la ocurrencia de huecos en los contornos de un dibujo:**

source: Activate or deactivate the **Gap Check** from the View menu.
es: Activar la opción **Comprobación de huecos** en el menú Ver.

source: **To check if the areas in the drawing are well-defined:**
es: **Para comprobar si las áreas de un dibujo se encuentran correctamente definidas:**

source: Activate or deactivate the **Fill Check** from the View menu.
es: Activar la opción **Comprobación de áreas rellenables** en el menú Ver.

source: Checking Painted Drawings
es: Comprobación de pintura en dibujos

source: To control if all the drawings areas are properly painted, and to see if the filling left small gaps along the lines antialiasing, or where a certain style is being used to paint lines or areas, it is possible to activate a series of checks:
es: Para controlar si todas las áreas se encuentran apropiadamente pintadas, así como para revisar si el relleno dejó pequeños huecos contra el suavizado de bordes de las líneas, o si un determinado estilo ha sido usado para pintar líneas o áreas, es posible activar toda una serie de modos de comprobación en el Visor:

source: The **Transparency Check** displays all the painted areas in the color defined in Preferences → Colors → **Paint Color**, all the lines or vector strokes in the color defined in Preferences... → Colors → **Ink Color on White BG** (or **Ink Color on Black BG**, depending on the chosen background color).
es: La **Comprobación de transparencias** permite visualizar todas las áreas pintadas de la imagen usando el color definido en la opción **Pintura:** del diálogo Archivo → Preferencias... → Colores; y todas las líneas o trazos vectoriales de la imagen que usan el color definido en la opción **Tinta (fondo blanco):** (o **Tinta (fondo negro):** dependiendo de si también se encuentra activada la opción **Ver con fondo negro**).

source: The **Ink Check** displays the *lines or vector strokes*, colored with the current style in red.
es: **Comprobación de líneas** permite visualizar en color *rojo* las *líneas o trazos vectoriales* que estén usando el estilo actualmente seleccionado.

source: The **Paint Check** displays the *areas* painted with the current color in red.
es: **Comprobación de áreas pintadas** permite visualizar en color *rojo* las *áreas* que estén rellenas usando el estilo actualmente seleccionado.

source: The **Black BG Check** displays the background color, defined in the Scene Settings, in black (see :ref:`Customizing the Viewer <customizing_the_work_area>` ).
es: **Ver con fondo negro** permite visualizar en color *negro* el color de fondo definido en el diálogo **Opciones de escena** (ver :ref:`Personalización del Visor <customizing_the_work_area>` ).

source: All the checks can also be combined in order to achieve specific display modes (see also :ref:`Checking Gaps in the Drawing Outline <checking_gaps_in_the_drawing_outline>` ).
es: También es posible combinar todas las comprobaciones que sea necesario para lograr modos específicos de visualización (ver también :ref:`Comprobación de huecos en contornos de dibujos <checking_gaps_in_the_drawing_outline>` ).

source: **To activate or deactivate a check:**
es: **Para activar o desactivar una comprobación:**

source: Activate or deactivate the check from the View menu.
es: Activar o desactivar la comprobación correspondiente en el menú Ver.

source: Painting Lines
es: Pintura de líneas

source: Lines of a drawing can be painted with the **Fill** tool (|fill|). For Toonz Raster drawings, the Fill tool (|fill|) affects continuous lines sharing the same style; for Toonz Vector drawings, only a single vector stroke at a time.
es: Es posible pintar las líneas o trazos vectoriales de un dibujo usando la herramienta **Rellenar** (|fill|). En el caso de niveles de Imagen de Toonz, la herramienta Rellenar (|fill|) afectará a todas las líneas continuas que compartan el mismo estilo; en el caso de niveles Vectorial de Toonz, sólo afectará a un trazo a la vez.

source: For Toonz Raster drawings, lines can be also painted with the **Paint Brush** tool (|paint_brush|) set to **Lines** mode. In this case by setting the size of the tool, you can paint any section of the lines as if you were using a brush.
es: En niveles de Imagen de Toonz, también es posible pintar líneas usando la herramienta **Brocha** (|paint_brush|) en el Modo **Líneas**. En este caso, basta con definir un **Tamaño:** para la herramienta y será posible pintar cualquier sección de las líneas, como si se estuviera usando un pincel.

source: For Toonz Vector drawings, a vector stroke can be also painted by selecting it first, then selecting the style you want in the level Palette.
es: En niveles Vectorial de Toonz, también es posible pintar un trazo seleccionándolo, y luego seleccionando el nuevo estilo que se desee usar para el mismo en la Paleta del nivel.

source: **To paint a Toonz Raster line:**
es: **Para pintar una línea en un nivel de Imagen de Toonz:**

source: Select the **Fill** tool (|fill|), set the fill mode to **Lines** and select a style in the palette.
es: Seleccionar la herramienta **Rellenar** (|fill|), definir el Modo en **Líneas** y seleccionar un estilo en la Paleta.

source: Click the line you want to paint.
es: Hacer clic sobre la línea que se desee pintar.

source: **To paint a Toonz Vector stroke:**
es: **Para pintar un trazo en un nivel Vectorial de Toonz:**

source: Select the **Fill** tool (|fill|), set the fill mode to **Lines**, select a style in the Palette and click the stroke you want to paint.
es: Seleccionar la herramienta **Rellenar** (|fill|), definir el Modo en **Líneas**, seleccionar un estilo en la Paleta y hacer clic sobre el trazo que se desee pintar.

source: With the **Selection** tool (|selection|) select the strokes you want to paint, then select a style in the Palette (see :ref:`Using the Selection Tool <using_the_selection_tool>` ).
es: Con la herramienta **Seleccionar** (|selection|) seleccionar los trazos que se desee pintar, luego seleccionar un estilo en la Paleta (ver :ref:`Uso de la herramienta Seleccionar <using_the_selection_tool>` ).

source: **To partially paint a Toonz Raster line:**
es: **Para pintar parcialmente una línea en un nivel de Imagen de Toonz:**

source: Select the **Fill** tool (|fill|), set the fill mode to **Lines**, activate the **Segment** option, and click the line section you want to paint.
es: Seleccionar la herramienta **Rellenar** (|fill|), definir el Modo en **Líneas**, activar la opción **Segmento** y hacer clic en la sección que se desee pintar.

source: Select the **Paint Brush** tool (|paint_brush|), set the mode to **Lines** and use it on the line section you want to paint.
es: Seleccionar la herramienta **Brocha** (|paint_brush|), definir el Modo en **Líneas** y pintar sobre la sección que se desee cambiar de color.

source: Use the **Paint Brush** tool (|paint_brush|) with the proper style to split a continuous line into sections, then use the **Fill** tool (|fill|) to paint the previously separated sections.
es: Usar la herramienta **Brocha** (|paint_brush|) con el estilo apropiado, para dividir una línea continua en secciones, luego usar la herramienta **Rellenar** (|fill|) para pintar las secciones previamente separadas.

source: **To paint several separated lines or vector strokes, at once:**
es: **Para pintar a la vez varias líneas o trazos vectoriales separados:**

source: Select the **Fill** tool (|fill|), set the fill mode to **Lines**.
es: Seleccionar la herramienta **Rellenar** (|fill|), definir el Modo en **Líneas**.

source: Set the type to **Rectangular** and click and drag to define a box: all the lines included in the box will be painted with the current style.
es: Definir el Tipo en **Rectangular** y arrastrar para definir un marco rectangular: todas las líneas incluidas en el mismo serán pintadas con el estilo seleccionado.

source: Set the type to **Freehand** and click and drag to define an area: all the lines included in the area you defined will be painted with the current style. If the ends of the area you draw are open, it will be defined as if joining the two open ends.
es: Definir el Tipo en **Lazo** y arrastrar para definir una región a mano alzada: todas las líneas incluidas en la misma serán pintadas con el estilo seleccionado. Si al definir la región los extremos quedaran abiertos, ésta se completará usando una línea recta entre los mismos.

source: Set the type to **Polyline** and click to define an area by drawing a series of straight lines: all the lines *completely included* in the area you defined will be painted with the current style. If the ends of the area you draw are open, the area will be defined as if joining the two open ends.
es: Definir el Tipo en **Línea poligonal** y hacer clic para definir una región mediante una serie de segmentos de recta: todas las líneas incluidas en la misma serán pintadas con el estilo seleccionado. Si al definir la región los extremos quedaran abiertos, ésta se completará usando una línea recta entre los mismos.

source: A vector stroke will be painted only if it's *fully included* in the area you define.
es: Los trazos vectoriales sólo serán pintados si se encontraran *completamente incluidos* en la región definida.

source: **To paint lines or vector strokes, in several frames with a single command:**
es: **Para pintar líneas o trazos vectoriales a lo largo de varios fotogramas, usando un solo comando:**

source: Select the **Fill** tool (|fill|), set the fill mode to **Lines** and activate the **Frame Range** option.
es: Seleccionar la herramienta **Rellenar** (|fill|), definir el Modo en **Líneas** y activar la opción **Rango de fotogramas**.

source: Select the first frame of the range and **click** the line you want to paint.
es: Seleccionar el primer fotograma del rango y **hacer clic** sobre la línea que se desee pintar.

source: Select the last frame of the range you want to apply the paint to, and **click** on the same line: the line in all the frames in the range will be automatically painted according to the first and second clicking positions.
es: Seleccionar el último fotograma del rango que se desee pintar y hacer **clic** sobre la misma línea: la línea en todos los fotogramas del rango será automáticamente pintada, de acuerdo a las posiciones marcadas.

source: Select an intermediate frame of the range you want to apply the paint to, and **Shift-click** in the same line: the line in all of the frames in the range will be automatically painted, according to the first and second clicking positions. Select another intermediate frame and **Shift-click** again: the line in all of the frames in the new range will be automatically painted, according to the second and third clicking positions. Do the same as many times as you like, then **click** in the same line on the last frame of the range, to complete the multi frame painting mode.
es: Seleccionar un fotograma intermedio del rango que se desee pintar y hacer **Mayúsculas + clic** sobre la misma línea: la línea en todos los fotogramas del rango será automáticamente pintada, de acuerdo a las posiciones marcadas. Seleccionar otro fotograma intermedio y hacer **Mayúsculas + clic** nuevamente: la línea en todos los fotogramas de nuevo rango será automáticamente pintada, de acuerdo a las posiciones marcadas. Repetir esto tantas veces como fuera necesario, luego hacer **clic** sobre la misma línea en el último fotograma del rango, para completar el modo de pintura de múltiples fotogramas.
