Repository: neloduka-sobe/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/painting_animation_levels.po
Languages: es

source: Painting Animation Levels
es: Pintura de niveles de animación

source: Toonz animation levels, both those cleaned up, and those made directly in OpenToonz, can be painted by using the styles, stored in the palette, and a set of tools.
es: Es posible pintar los niveles de animación (tanto los escaneados y limpiados, como los creados directamente en OpenToonz) usando los estilos almacenados en la paleta y un conjunto de herramientas para ese propósito.

source: All Toonz level drawings are made of **lines** (determined by the strokes of scanned or vector drawings), and **areas** defined by *closed lines*. Raster and vector lines can be painted or erased, partially or for their full extent; areas can be filled with styles, or remain empty, with complete transparency.
es: Tanto los niveles de animación de tipo Vectorial de Toonz como Imagen de Toonz están compuestos por **líneas** (definidas por trazos vectoriales o líneas dibujadas en imágenes) y **áreas** que quedan demarcadas por *líneas cerradas*. Es posible pintar o borrar las líneas tanto en imágenes estándar como vectoriales, parcial o totalmente; las áreas pueden ser rellenadas con estilos o ser mantenidas vacías para lograr su transparencia.

source: All the painting work is not saved until you save the related level, or use the **Save All** command (see :ref:`Saving Levels <saving_levels>` ).
es: Los cambios generados por los trabajos de pintura permanecerán en memoria y no serán guardados en disco hasta que el nivel correspondiente sea guardado o se use el comando **Guardar todos los niveles** o **Guardar todo** (ver :ref:`Guardado de niveles <saving_levels>` ).

source: If the computer performance worsens during the painting process of Toonz Raster animation levels, try activating the **Minimize Raster Memory Fragmentation** option in the Preferences... → General dialog section (see :ref:`Optimizing the Memory Usage <optimizing_the_memory_usage>` ).
es: Si el rendimiento del sistema empeorara durante el proceso de pintura de niveles de Imagen de Toonz, intentar activar la opción **Minimizar fragmentación de imágenes en memoria** en el diálogo Archivo → Preferencias... → General (ver :ref:`Optimización del uso de memoria <optimizing_the_memory_usage>` ).

source: Painting Tools
es: Herramientas de pintura

source: Painting operations can be performed by using the **Fill** tool (|fill|) and the **Paint Brush** tool (|paint_brush|).
es: Es posible realizar las operaciones de pintura mediante el uso de las herramientas **Rellenar** (|fill|) y **Brocha** (|paint_brush|).

source: In case you want to retrieve a style already used in the drawing, you can pick it with the **Style Picker** tool (|style_picker|).
es: En caso de desear recuperar uno de los estilos usados en el dibujo, para poder pintar con él, es posible usar la herramienta **Selector de estilos** (|style_picker|) para tomarlo directamente desde la imagen.

source: The filling operation can be performed by activating different options, that can be combined together to perform particular tasks, for example to fill several areas at the same time with the same style, or several frames, with a single operation.
es: Las operaciones de relleno pueden llevarse a cabo activando distintas opciones que pueden ser combinadas entre sí para realizar tareas particulares, por ejemplo, para rellenar varias áreas al mismo tiempo usando el mismo estilo o para rellenar áreas en varios fotogramas en una única operación.

source: The **Fill** tool (|fill|) allows you to paint a drawing area or line by clicking it. Options available are the following:
es: La herramienta **Rellenar** (|fill|) permite pintar un área o línea de un dibujo, haciendo clic sobre ella. Las opciones disponibles son las siguientes:

source: **Type:** has the options **Normal**, to fill an area by clicking in it; **Rectangular**, to fill all the areas included in the box you define; **Freehand**, to fill all the areas included in the area you outline by clicking and dragging; and **Polyline**, to fill all the areas included in the area you outline by defining a series of lines.
es: **Tipo:** contiene las opciones: **Normal**, para rellenar un área al hacer clic en ella; **Rectangular**, para rellenar todas las áreas incluidas en un marco rectangular; **Lazo**, para rellenar todas las áreas incluidas en un área definida al hacer clic y arrastrar; y **Línea poligonal**, para rellenar todas las áreas incluidas en un área definida por una serie de segmentos de recta.

source: **Mode:** has the options **Areas**, to fill only areas, **Lines**, to paint only the strokes, and **Lines and Areas**, to perform both operations.
es: **Modo:** contiene las opciones: **Áreas**, para rellenar sólo áreas, **Líneas**, para pintar sólo trazos, y **Líneas y Áreas**, para realizar ambas operaciones.

source: **Selective** prevents the fill operation to be performed on *already filled* areas.
es: **Selectivo** evita que se realicen operaciones de relleno en áreas *ya rellenas*.

source: **Fill Depth** sets how much the fill style passes through the antialiasing of the area lines. With low values, even a very thin line made of semitransparent pixels will be effective to stop de filling operation; with high values, only the more opaque pixels will stop color from flooding outside. This option applies to Toonz Raster drawings only. It is possible to set two values: the minimum value is used when using the tool with the standard mouse **click**, the maximum value when using the tool with the **Shift-click**.
es: **Profundidad de relleno** permite definir qué tanto pasará el estilo usado para rellenar por sobre el suavizado de bordes de los contornos del área. Al usar valores bajos, hasta una fina línea semitransparente será efectiva para detener la operación de relleno; al usar valores altos, sólo los píxeles más opacos detendrán al color para que no se derrame hacia el exterior. Esta opción se aplica solamente a niveles de Imagen de Toonz. Es posible definir dos valores para la profundidad: **Mín:**, que actuará cuando se use la herramienta haciendo **clic** con el ratón, y **Máx:** que lo hará cuando se use haciendo **Mayúsculas + clic**.

source: **Segment** lets you apply the fill only to a segment of raster lines. A segment is determined by an abrupt change of *thickness* or *direction* in the stroke. This is available for Toonz Raster drawings only.
es: **Segmento** permite aplicar el relleno sólo a un segmento de una línea. Los segmentos quedarán determinados por cambios abruptos en el *grosor* o la *dirección* de la línea. La opción se encuentra disponible solamente para niveles de Imagen de Toonz.

source: **Onion Skin** lets you pick the style to use for the filling operation from other drawings, visible in onion skin mode, and apply it to the current drawing (see :ref:`Using Onion Skin <using_onion_skin>` ).
es: **Piel de cebolla** permite seleccionar el estilo a usar para la operación de relleno desde dibujos en otros fotogramas, visibles en el modo Piel de cebolla, y aplicarlo al dibujo actual (ver :ref:`Uso de Piel de cebolla <using_onion_skin>` ).

source: **Frame Range** allows you to perform the filling on a range of frames, by clicking in the first and then in the last frame of the range. You can also Shift-click to define the filling position for intermediate frames.
es: **Rango de fotogramas** permite realizar el relleno en un rango de fotogramas, haciendo clic en el primero y luego en el último fotograma del rango. También es posible usar *Mayúsculas + clic* para definir la posición de relleno en fotogramas intermedios.

source: The **Paint Brush** tool (|paint_brush|) allows you to paint a drawing area or a line, as if you were using a brush. It is available for Toonz Raster drawings only. Options are the following:
es: La herramienta **Brocha** (|paint_brush|) permite pintar áreas o líneas de un dibujo, como si se estuviera usando un pincel. Se encuentra disponible sólo en niveles de Imagen de Toonz. Las opciones disponibles son las siguientes:

source: **Size** sets the brush size.
es: **Tamaño** permite definir el tamaño del pincel.

source: **Mode:** has the options **Areas**, to paint only inside areas, **Lines**, to paint manually only the drawing lines, and **Lines and Areas**, to perform both operations.
es: **Modo:** contiene las opciones: **Áreas**, para pintar sólo dentro de áreas, **Líneas**, para pintar sólo dentro de trazos, y **Líneas y Áreas**, para realizar ambas operaciones.

source: **Selective** prevents the painting operation to be performed on *already painted* areas.
es: **Selectivo** evita que se realicen operaciones de pintura en lugares *ya pintados*.

source: Filling Areas
es: Relleno de áreas

source: Areas can be filled when their outline is well-defined, with no gaps occurring along it. For vector drawings, the outline can be defined by a single vector with overlapping or joined ends, or by different vectors.
es: Es posible rellenar áreas cuando sus contornos se encuentren bien definidos y sin huecos. En el caso de dibujos vectoriales, el contorno puede estar definido tanto por un único trazo cuyos extremos se encuentren o crucen, como por varios trazos.

source: Options available for the painting tools can help you to speed up the painting job. You can decide which options are the most suitable for your task by following the guidelines below.
es: Las opciones disponibles en las herramientas de pintura pueden ayudar a acelerar el proceso de pintado. Es posible decidir qué opciones serán las más apropiadas para una tarea siguiendo la siguiente guía:

source: In Toonz Raster levels, the areas that can be painted are limited either by the image border or by the image *Savebox*, according to the **Use the TLV Savebox to Limit Filling Operations** option available in Preferences... → Tools.
es: En los niveles de Imagen de Toonz, las áreas que pueden ser pintadas estarán delimitadas tanto por el propio borde de la imagen, como por el *Marco delimitador* de la imagen, de acuerdo a la opción **Al usar Rellenar en niveles TLV, usar su marco delimitador como límite** disponible en el diálogo Archivo → Preferencias... → Herramientas.

source: Some styles may not be suitable for filling areas, such as the **Trail** or **Vector** styles or some of the **Generated** styles. If you select one of these styles in the Palette, and you use it to fill an area, no operation will be performed.
es: Algunos estilos no son apropiados para rellenar áreas, como los de las categorías **Rastros** o **Pinceles vectoriales** y algunos de los de la categoría **Generados**. Si se selecciona uno de estos estilos en la Paleta y se usara para intentar rellenar un área, no se realizará ninguna operación.

source: **To fill an area:**
es: **Para rellenar un área:**

source: Select the **Fill** tool (|fill|), set the fill type to **Normal** and the mode to **Areas**, and select a style in the Palette.
es: Seleccionar la herramienta **Rellenar** (|fill|), definir el Tipo de relleno en **Normal** y el Modo en **Áreas**, y seleccionar un estilo en la Paleta.

source: Click in the area you want to fill.
es: Hacer clic en el área que se desee rellenar.

source: If the filling color doesn’t flood the narrowest areas in raster drawings because of semitransparent pixels, try to increase the minimum **Fill Depth** value, or **Shift-click** to use the maximum value (see :ref:`Painting Tools <painting_tools>` ).
es: Si el color de relleno no llegara a las áreas más estrechas de un dibujo de imagen, a causa de la existencia de píxeles semitransparentes, es posible intentar aumentar el valor mínimo de la **Profundidad de relleno** o usar **Mayúsculas + clic** para usar el valor máximo (ver :ref:`Herramientas de pintura <painting_tools>` ).

source: **To fill several frames with a single command:**
es: **Para rellenar en varios fotogramas usando un único comando:**

source: Select the **Fill** tool (|fill|), set the fill type to **Normal** and the mode to **Areas**, and activate the **Frame Range** option.
es: Seleccionar la herramienta **Rellenar** (|fill|), definir el Tipo de relleno en **Normal** y el Modo en **Áreas**, y activar la opción **Rango de fotogramas**.

source: Select the first frame of the range and **click** in the area you want to fill, for example the character’s face.
es: Seleccionar el primer fotograma del rango y hacer **clic** en el área que se desee rellenar, por ejemplo el rostro de un personaje.

source: Do one of the following:
es: Hacer una de las siguientes cosas:

source: Select the last frame of the range you want to apply the Fill to, and **click** in the same area, in the example the character’s face: the areas in all of the frames in the range will be automatically filled according to the first and second clicking positions.
es: Seleccionar el último fotograma del rango al cual se desee aplicar el relleno y hacer **clic** en la misma área, en el ejemplo el rostro del personaje: las áreas en todos los fotogramas del rango serán automáticamente rellenadas de acuerdo a las dos posiciones marcadas.

source: Select an intermediate frame of the range you want to apply the Fill to, and **Shift-click** in the same area, in the example the character’s face: the areas in all of the frames in the range will be automatically filled according to the first and second clicking positions. Select another intermediate frame and **Shift-click** again: the areas in all of the frames in the new range will be automatically filled according to the second and third clicking positions. Do the same as many times as you like, then **click** in the same area on the last frame of the range to complete the multi frame filling mode.
es: Seleccionar un fotograma intermedio del rango que se desea rellenar y presionar **Mayúsculas + clic** en la misma área, en el ejemplo el rostro del personaje: las áreas en todos los fotogramas del rango serán automáticamente rellenadas de acuerdo a las dos posiciones marcadas. Seleccionar otra área intermedia y presionar **Mayúsculas + clic** nuevamente: las áreas en los fotogramas del nuevo rango serán automáticamente rellenadas de acuerdo a la posición marcada previamente y la nueva. Hacer lo mismo tantas veces como sea necesario y luego hacer **clic** en la misma área en el último fotograma del rango para finalizar el modo de relleno de múltiples fotogramas.

source: Since the **Fill** with the **Frame Range** option is applied making a linear interpolation from the first clicking point to the following one, some painting mistakes may occur. The more the area you want to fill moves along the frame range, the more mistakes may be made.
es: Como al usar la opción **Rango de fotogramas** la herramienta **Rellenar** es aplicada utilizando una interpolación lineal desde la primera posición hasta la siguiente, es posible que ocurran algunos errores de relleno. Cuanto más se mueva el área que se desea rellenar en dicho rango, más posible será la ocurrencia de tales errores.

source: **To fill several areas at once with the same style:**
es: **Para rellenar varias áreas a la vez usando el mismo estilo:**

source: Select the **Fill** tool (|fill|), set the fill mode to **Areas**.
es: Seleccionar la herramienta **Rellenar** (|fill|), definir el Modo en **Áreas**.

source: Set the type to **Rectangular** and click and drag to define a box: all the areas *completely included* in the box will be filled with the current style.
es: Definir el Tipo en **Rectangular** y arrastrar para definir un marco rectangular: todas las áreas *completamente incluidas* en el marco serán rellenadas con el estilo actual.

source: Set the type to **Freehand** and click and drag to outline an area: all the areas *completely included* in the area you outline will be filled with the current style. If the ends of the outline you draw are open, the area will be defined as if joining the two open ends.
es: Definir el Tipo en **Lazo** y arrastrar para definir una región a mano alzada: todas las áreas *completamente incluidas* en la región definida serán rellenadas con el estilo actual. Si los extremos de la región definida estuvieran abiertos, la misma se definirá uniendo ambos extremos en línea recta.

source: Set the type to **Polyline** and click to outline an area by defining a series of lines: all the areas *completely included* in the area you outline will be filled with the current style. If the ends of the outline you draw are open, the area will be defined as if joining the two open ends.
es: Definir el Tipo en **Línea poligonal** y hacer clic para definir una región mediante varios segmentos de recta: todas las áreas *completamente incluidas* en la región definida serán rellenadas con el estilo actual. Si los extremos de la región definida estuvieran abiertos, la misma se definirá uniendo ambos extremos en línea recta.

source: **To fill all remaining areas in a level drawing with the same style:**
es: **Para rellenar todas las áreas restantes de un dibujo usando el mismo estilo:**

source: Select the **Fill** tool (|fill|), set the fill type to **Rectangular** and the mode to **Areas**, and activate the **Selective** option.
es: Seleccionar la herramienta **Rellenar** (|fill|), definir el Tipo en **Rectangular** y el Modo en **Areas**, y activar la opción **Selectivo**.

source: **Click and drag** to define a box: all the outlined non-filled areas *completely included* in the box will be filled with the current style. This option combination may be useful if the drawing has a lot of areas to be painted with the same style, that can be painted at the end at once by using this command.
es: **Hacer clic y arrastrar** para definir un marco rectangular: todas las áreas correctamente definidas y no rellenas *completamente incluidas* en el marco serán rellenadas con el estilo actual. Esta combinación de opciones puede resultar útil cuando un dibujo contenga múltiples áreas a ser pintadas con el mismo estilo, y que puedan ser pintadas a la vez al final del proceso, utilizando esta técnica.

source: You can add to this combination the **Frame Range** option as well, to perform the same task extended to a range of frames.
es: También es posible sumar a esta combinación la opción **Rango de fotogramas**, para realizar la misma tarea pero extendida a todo un rango de fotogramas.

source: **To fill drawing areas using as reference a previously painted drawing:**
es: **Para rellenar áreas de un dibujo usando como referencia un dibujo pintado previamente:**

source: **Activate the onion skin** mode to display the painted drawing behind your current drawing (see :ref:`Using Onion Skin <using_onion_skin>` ).
es: **Activar el modo Piel de cebolla** para mostrar el dibujo pintado detrás del dibujo actual (ver :ref:`Uso de Piel de cebolla <using_onion_skin>` ).

source: Select the **Fill** tool (|fill|), set the fill mode to **Areas** and activate the **Onion Skin** option.
es: Seleccionar la herramienta **Rellenar** (|fill|), definir el Modo en **Áreas** y activar la opción **Piel de cebolla**.

source: **Click** to pick the style to use from the drawing displayed in onion skin mode.
es: **Hacer clic** para escoger el estilo a usar, desde el dibujo mostrado en modo Piel de cebolla.

source: **Release** to fill the area where the cursor is.
es: **Soltar** para rellenar el área donde se encuentre el puntero.

source: **Drag** to the area you want to fill and **release** the mouse button.
es: **Arrastrar** hasta el área que se desee rellenar y **soltar** allí.

source: If several drawings are displayed in onion skin mode, only the drawing closest to the current one will be considered.
es: Si hubiera varios dibujos siendo mostrados en modo Piel de cebolla, sólo será considerado el más próximo al actual.

source: **To automatically fill a whole drawing using as reference a previously painted drawing:**
es: **Para rellenar automáticamente un dibujo completo usando como referencia un dibujo pintado previamente:**

source: Select the **Fill** tool (|fill|), set the fill type to **Rectangular**, the mode to **Areas**, and activate the **Onion Skin** option.
es: Seleccionar la herramienta **Rellenar** (|fill|), definir el Tipo en **Rectangular**, el Modo en **Áreas**, y activar la opción **Piel de cebolla**.

source: **Click and drag** to define a box: all the areas *completely included* in the box will be filled with the styles picked from the painted areas of the drawing displayed in onion skin mode.
es: **Hacer clic y arrastrar** para definir un marco rectangular: todas las áreas *completamente incluidas* en el marco rectangular serán rellenadas con los estilos escogidos desde las áreas pintadas del dibujo mostrado en modo Piel de cebolla.

source: If some areas are automatically painted with the wrong style, fix them to prevent the mistake to be amplified in the following frames you are going to paint.
es: Si algunas áreas fueran rellenadas automáticamente con un estilo incorrecto, corregirlas para evitar que el error sea amplificado en los fotograma siguientes a ser pintados.

source: **To retrieve a style from a drawing:**
es: **Para escoger un estilo desde un dibujo:**

source: Select the **Style Picker** tool (|style_picker|).
es: Seleccionar la herramienta **Selector de estilos** (|style_picker|).

source: Click in the area whose style you want to pick. The picked style becomes the current one.
es: Hacer clic en el área cuyo estilo se desee escoger. El estilo escogido se tornará el estilo actual.

source: Closing Gaps in Drawing Outline
es: Cierre de huecos en contornos de dibujos

source: If the area outline is not perfectly defined, you will not be able to fill it. The gap can be closed by adding a line with the **Brush** (|brush|) or **Geometric** (|geometric|) tools (see :ref:`Drawing Tools <drawing_tools>` ), or by using the **Tape** tool (|tape|).
es: Cuando el contorno de un área no estuviera perfectamente definido, no será posible rellenarla. Es posible cerrar el hueco agregando una línea con las herramientas **Pintar** (|brush|) o **Geometría** (|geometric|) (ver :ref:`Herramientas de dibujo <drawing_tools>` ), o mediante el uso de la herramienta **Cinta** (|tape|).

source: For Toonz Vector drawings the **Tape** tool (|tape|) allows you to join vector strokes manually or automatically, both considering their endpoints and any point along the strokes themselves, according to the tool settings. Options available are the following:
es: En niveles Vectorial de Toonz la herramienta **Cinta** (|tape|) permite unir trazos vectoriales de forma manual o automatica, tanto considerando sus extremos como cualquier otro punto a lo largo de los trazos, según las opciones escogidas. Las opciones disponibles son las siguientes:

source: **Type:** has the options **Normal**, to manually define joining vectors, or **Rectangular**, to automatically close all the gaps detected in the box you define.
es: **Tipo:** contiene las opciones **Normal** para definir manualmente la unión de los vectores, o **Rectangular** para cerrar de forma automática todos los huecos detectados en el marco rectangular definido.

source: When the type is set to **Rectangular** only gaps between endpoints, and between an endpoint and a line, are considered.
es: Cuando el Tipo está en **Rectangular** sólo se considerarán huecos producidos entre los extremos, o entre un extremo y una línea.
