Repository: neloduka-sobe/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/painting_animation_levels.po
Languages: es

source: Click the area or line whose style you want to pick, whatever your current tool is.
es: Hacer clic sobre el área o línea cuyo estilo se desee escoger, independientemente de cual sea la herramienta que se encuentre seleccionada.

source: If you are using a Raster image as reference and you decided to keep the current animation level palette, when you click an area or a line, the closest style available in the palette will be picked.
es: Si se está usando una imagen normal como referencia y se decidió mantener la paleta actual del nivel de animación, al hacer clic sobre un área o línea, el estilo más parecido disponible en la paleta será seleccionado.

source: **To navigate the color model viewer:**
es: **Para navegar en el visor de modelo de color:**

source: Use the zoom shortcut keys (by default + and - keys) to zoom in and zoom out at specific steps (e.g. 50%, 100%, 200%, etc.).
es: Usar la teclas de atajo para el zoom (de forma predefinida **+** y **-**) para acercar o alejar de a pasos predefinidos (50%, 100%, 200%, etc.).

source: Use the mouse wheel to zoom in and zoom out.
es: Usar la rueda del ratón para acercar o alejar la imagen en el visor.

source: Use the Reset View shortcut (by default the 0 key), or right-click in the viewer and choose **Reset View** from the menu that opens, to display the flipbook content at its actual size, centered on the image center.
es: Usar el atajo para **Restablecer vista** (de forma predefinida **Alt+0**), o hacer clic derecho en el visor y elegir **Restablecer vista** en el menú, para mostrar el contenido del visor de Modelo de color en su tamaño real, centrado en el visor.

source: Middle-click and drag to scroll in any direction.
es: Hacer clic central y arrastrar en la dirección deseada.

source: **To create a color model from an original drawing:**
es: **Para crear un modelo de color a partir de un dibujo original:**

source: Scan and cleanup, or draw, your color model.
es: Escanear y limpiar, o dibujar el modelo de color.

source: Create the needed styles in the palette and paint the image.
es: Crear los estilos necesarios en la paleta y pintar la imagen.

source: Save the image and load it as color model whenever it is needed.
es: Guardar la imagen y cargarla como un Modelo de color, cuando sea necesario.

source: **To use a drawing from the current animation level as a model:**
es: **Para usar un dibujo del nivel de animación seleccionado como modelo de color:**

source: Select the drawing you want to use as a reference for the current animation level.
es: Seleccionar el dibujo que se desee usar como referencia para el nivel de animación actual.

source: Right-click in the Color Model viewer and choose **Use Current Frame** from the menu that opens.
es: Hacer clic derecho sobre el visor de Modelo de color y elegir **Usar fotograma actual** en el menú.

source: **To store a color model together with a palette in the studio palette:**
es: **Para almacenar un modelo de color junto con una paleta en la paleta de estudio:**

source: Load the color model to associate it to the current level palette.
es: Cargar el Modelo de color para asociarlo a la paleta del nivel actual.

source: Store the level palette in the Studio Palette (see :ref:`Using the Studio Palette <using_the_studio_palette>` for details).
es: Almacenar la paleta del nivel en la Paleta de estudio (ver :ref:`Uso de la Paleta de estudio <using_the_studio_palette>` para más detalles).

source: **To associate a color model to a palette already saved in the studio palette:**
es: **Para asociar un modelo de color a una paleta ya guardada en la paleta de estudio:**

source: In the Studio Palette select the palette to which you want to associate a color model, and do one of the following:
es: En la Paleta de estudio seleccionar la paleta a la que se desee asociar un Modelo de color, y hacer una de las siguientes cosas:

source: Choose File → **Load Color Model...**.
es: Elegir Archivo → **Cargar modelo de color...**.

source: Right-click the palette in the studio palette tree and choose **Load Color Model...** from the menu that opens (see :ref:`Using the Studio Palette <using_the_studio_palette>` for details).
es: Hacer clic derecho sobre la paleta, en el árbol de la Paleta de estudio, y elegir **Cargar modelo de color...** en el menú (ver :ref:`Uso de la Paleta de estudio <using_the_studio_palette>` para más detalles).

source: Retrieve the color model from the browser that opens.
es: Cargar el Modelo de color, usando el Explorador emergente.

source: If the color model uses a palette different from the one stored in the Studio Palette, you will be prompted whether to keep it or to overwrite it.
es: Si el Modelo de color utilizara una paleta distinta a la ya almacenada en la Paleta de estudio, se consultará acerca de si se desea mantenerla o sobrescribirla.

source: **To retrieve a color model stored in the studio palette:**
es: **Para recuperar un modelo de color almacenado en la paleta de estudio:**

source: Load the palette it's associated to from the Studio Palette as the current level palette (see :ref:`Using the Studio Palette <using_the_studio_palette>` for details).
es: Cargar la paleta a la que se encuentra asociado, desde la Paleta de estudio, como paleta actual del nivel (ver :ref:`Uso de la Paleta de estudio <using_the_studio_palette>` para más detalles).

source: **To remove the association of a palette to a color model:**
es: **Para eliminar la asociación de una paleta a un modelo de color:**

source: Right-click in the Color Model viewer and choose **Remove Color Model** from the menu that opens.
es: Hacer clic derecho en el visor de Modelo de color y elegir **Eliminar modelo de color** en el menú.
