Repository: neloduka-sobe/opentoonz_docs
Catalog: source/locale/*/LC_MESSAGES/painting_animation_levels.po
Languages: es

source: Since the Fill tool (|fill|) with the Frame Range option is applied making a linear interpolation from the first to the second clicking point, some painting mistakes may occur. The more the line you want to fill moves along the frame range, the more mistakes may be made.
es: Como la herramienta **Rellenar** (|fill|) cuando está activada la opción **Rango de fotogramas** se aplica usando una interpolación lineal entre los puntos marcados en cada fotograma del rango, es posible que ocurran algunos errores de pintado. Cuanto más se mueva la línea que se desea pintar a lo largo del rango de fotogramas, más errores es posible que ocurran.

source: **To paint a line using as reference a previously painted drawing:**
es: **Para pintar una línea usando un dibujo anterior como referencia:**

source: Select the **Fill** tool (|fill|), set the fill mode to Lines and activate the **Onion Skin** option.
es: Seleccionar la herramienta **Rellenar** (|fill|), definir el Modo en **Líneas** y activar la opción **Piel de cebolla**.

source: Click to pick the style to use, from the drawing displayed in onion skin mode.
es: Hacer clic para escoger el estilo a usar, desde el dibujo mostrado en modo Piel de cebolla.

source: Release to paint the line where the cursor is.
es: Soltar para pintar la línea en la posición del cursor.

source: Drag to the line you want to paint and release the mouse button.
es: Arrastrar hasta la línea que se desea pintar y soltar para pintar.

source: Click the line whose style you want to pick. The picked style becomes the current one.
es: Hacer clic sobre la línea cuyo estilo se desea escoger. El estilo escogido se tornará el estilo actual.

source: Using Match Lines
es: Uso de Líneas de coincidencia

source: Sometimes it may be useful to split a hand-drawn animation level into several animation levels that can be scanned separately, and later re-assembled before the painting process. For example you can draw an animation level with some shadow lines that match perfectly a character animation, then apply them with a color different from the character lines in order to paint them more easily.
es: Algunas veces puede resultar útil separar un nivel de animación hecho a mano en varios niveles para que puedan ser escaneados por separado y luego rearmados, antes del proceso de pintado. Por ejemplo, es posible dibujar un nivel de animación con algunas líneas de sombra que coincidan perfectamente con la animación de un personaje, luego aplicarles un color distinto al de las líneas del personaje, para poder más fácilmente.

source: Some other times you may need to merge two or several animation levels into a single one, or automatically add the same drawing on all of the drawings of an animation level, for example a line closing the drawing areas that fall outside the shot and that the animator left open.
es: Otras veces es posible que sea necesario fusionar dos o más niveles de animación en uno solo, o agregar el mismo dibujo automáticamente en todos los dibujos de un nivel de animación, por ejemplo una línea que cierre las áreas dibujadas que llegan hasta fuera del encuadre y que el animador dejó abiertas.

source: In both cases you can use the match lines feature to achieve your tasks, as it allows you to merge the levels exposed in two columns/layers, and if needed to delete the merged match lines.
es: En ambos casos es posible usar la función de Líneas de coincidencia para realizar dichas tareas, ya que permite fusionar los niveles expuestos en dos columnas/capas y, si fuera necesario, eliminar las líneas de coincidencia fusionadas.

source: Match lines can only be applied to Toonz Raster (TLV) animation levels.
es: Sólo es posible aplicar Líneas de coincidencia en niveles de Imagen de Toonz (TLV).

source: In the Xsheet, when two columns are merged, the column drawings on the right are considered as match lines applied to the drawings on the left (in the Timeline, when two layers are merged, the layer drawings on top are considered as match lines applied to the drawings on the bottom).
es: En la Planilla, al fusionar dos columnas, los dibujos de la columna de la derecha se considerarán como *líneas de coincidencia* a ser aplicadas a la columna de la izquierda (en la Línea de tiempo, al fusionar dos capas, los dibujos de la capa de arriba se considerarán como *líneas de coincidencia* a ser aplicadas a la capa de abajo).

source: In both cases it's possible to define the following:
es: En ambos casos es posible definir lo siguiente:

source: **Add Match Line Inks** preserves the original match line styles and adds them to the destination level palette in a separate page named **match lines**.
es: **Agregar estilos de líneas de coincidencia** preservará los estilos originales del nivel de líneas de coincidencia y los agregará a la paleta del nivel de destino, en una página llamada **match lines**.

source: **Use Ink:** allows you to define which style, among those in the destination level palette, has to be used for the applied match lines, replacing any original styles the match lines may be painted with.
es: **Usar estilo:** permite definir qué estilo, entre los de la paleta del nivel de destino, deberá usarse para las líneas de coincidencia aplicadas, reemplazando cualquier estilo original con el que estuvieran pintadas las líneas de coincidencia.

source: **Merge Inks** if the target level has the same styles (i.e. with the same index and color) as the match lines inks, the existing styles will be used. Otherwise, the original match line styles will be preserved and added to the destination level palette in a separate page named **match lines**.
es: **Fusionar tintas** usará los estilos existentes en la paleta del nivel de destino, si ésta ya contuviera los mismos estilos (con el mismo índice y color) que la paleta del nivel de líneas de coincidencia. En caso contrario, se preservarán los estilos originales del nivel de líneas de coincidencia y serán agregados a la paleta del nivel de destino, en una página llamada **match lines**.

source: **Line Stacking Order** let you graphically select which of the two columns (left or right) will be drawn on top, and also how to merge them: **Keep Halftones** or **Fill Gaps**
es: **Orden de líneas** permite seleccionar de forma visual cuál de las dos columnas (derecha o izquierda) será dibujada en frente, así como también el método a usar para fusionar ambas: **Mantener semitono** o **Rellenar huecos**.

source: **Line Prevalence** sets whether the match lines have to be placed behind the lines of the destination level (value set to 0), or on top of them (value set to 100).
es: **Prevalencia de líneas** permite definir si las líneas de coincidencia deberán ser ubicadas por detrás de las del nivel de destino (valor = 0) o por delante del mismo (valor = 100).

source: When the **Line Prevalence** value is set to 0, the match lines are applied without modifying the lines in the destination level at all.
es: Cuando el valor de la **Prevalencia de líneas** es 0, las líneas de coincidencia serán aplicadas sin modificar de ninguna forma a las líneas del nivel de destino.

source: When the match lines are applied, any geometrical transformation achieved by editing and moving the related column/layer or pegbar, will be retained.
es: Al aplicar las líneas de coincidencia, cualquier transformación geométrica lograda por medio de la edición o el movimiento de la columna/capa o barra de sujeción correspondientes, será preservada.

source: Match lines are associated to the animation level drawings according to the following guidelines:
es: Las líneas de coincidencia son asociadas a los dibujos de un nivel de animación, de acuerdo a la siguiente guía:

source: The Xsheet/Timeline frame numbering order is followed. This means that the match line drawing exposed at frame 1 will be applied to the animation drawing exposed at frame 1.
es: Se seguirá el orden de los fotogramas de la Planilla/Línea de tiempo. Esto significa que el dibujo con la líneas de coincidencia expuesto en el fotograma 1 será aplicado al dibujo de la animación del fotograma 1.

source: If two different match line drawings are associated to the same drawing of the animation level at different frames, only the first one (according to the frame numbering order) will be applied.
es: Si dos dibujos distintos de líneas de coincidencia se encontraran asociados, en diferentes fotogramas, al mismo dibujo de animación, sólo el primero de ellos será aplicado.

source: For all the drawings not corresponding to any match line drawing, no match lines will be applied.
es: Para los dibujos que no se correspondan con ningún dibujo de líneas de coincidencia, no se aplicarán líneas de coincidencia.

source: Match lines not corresponding to any drawing will be ignored.
es: Si hubiera líneas de coincidencia que no se correspondieran con ningún dibujo de animación, simplemente serán ignoradas.

source: If several animation levels are exposed in the column/layer to which match lines have to be applied, only the first one (according to the frame numbering order) will be considered.
es: Si hubiera varios niveles de animación expuestos en la columna/capa donde las líneas de coincidencia deben ser aplicadas, sólo el primero de ellos (de acuerdo al orden de fotogramas) será considerado.

source: If several animation levels are exposed in the column used as match line, all of them will be applied.
es: Si varios niveles de animación estuvieran expuestos en la columna usada como líneas de coincidencia, todos ellos serán aplicados.

source: Several match lines can be added to the same animation level, by applying them one at a time.
es: Es posible aplicar varias columnas/capas con líneas de coincidencia a un nivel de animación, haciéndolo una a la vez.

source: Applied match lines can be deleted as a whole from the destination level, or it is possible to delete specific lines according to their style indexes.
es: Las líneas de coincidencia ya aplicadas pueden ser borradas en su totalidad del nivel de destino, o también es posible borrar líneas específicas, indicando el índice de su estilo.

source: **To apply match lines to an animation level:**
es: **Para aplicar líneas de coincidencia a un nivel de animación:**

source: Expose in a column/layer the level you want to apply the match lines to.
es: Exponer en una columna/capa el nivel al que se desee aplicar las líneas de coincidencia.

source: Expose the match line animation level(s) in another column of the Xsheet, to the right of the previous one (or if using the Timeline, expose the match line animation level(s) in another layer, above the previous one).
es: Exponer el(los) nivel(es) conteniendo líneas de coincidencia en otra columna de la Planilla, a la derecha de la anterior (o, si se está usando la Línea de tiempo, exponer el(los) nivel(es) conteniendo líneas de coincidencia en otra capa, encima de la anterior).

source: Move, scale, rotate the match line drawings if needed.
es: Mover, rotar o escalar los dibujos con líneas de coincidencia, si fuera necesario.

source: Select the two columns by shift-clicking or click-draging their headers.
es: Seleccionar las dos columnas usando Mayúsculas + clic o haciendo clic y arrastrando, en el encabezado de las mismas.

source: Choose Xsheet → **Apply Match Lines...**
es: Elegir Planilla → **Aplicar líneas de coincidencia...**

source: In the dialog that opens choose the styles to be used for the match lines and the line prevalence, and click the Apply button.
es: En el diálogo emergente escoger los estilos a ser usados al aplicar las líneas de coincidencia y la prevalencia de líneas, y presionar el botón **Aplicar**.

source: **To delete all applied match lines:**
es: **Para borrar todas la líneas de coincidencia aplicadas a un nivel:**

source: Select the columns/layers, the cells, or the Level Strip frames where the animation level with the applied match lines is.
es: Seleccionar las columnas/capas o celdas de la Planilla/Línea de tiempo, o los dibujos de la Cinta de nivel, donde se encuentre el nivel de animación con las líneas de coincidencia aplicada.

source: Choose Xsheet → **Delete Match Lines**.
es: Elegir Planilla → **Borrar líneas de coincidencia**.

source: **To delete lines by selecting the style index:**
es: **Para borrar líneas indicando el índice de su estilo:**

source: Select the columns/layers, the cells, or the Level Strip frames where the animation level whose lines you want to delete is.
es: Seleccionar las columnas/capas o celdas de la Planilla/Línea de tiempo, o los dibujos de la Cinta de nivel, donde se encuentre el nivel de animación con las líneas de coincidencia aplicada.

source: Choose Xsheet → **Delete Lines...**
es: Elegir Planilla → **Borrar líneas...**

source: In the dialog that opens choose the indexes of the styles used for lines you want to delete, and the frames where you want to apply the deletion.
es: En el diálogo emergente elegir los índices de los estilos usados para las líneas que se desee borrar, y los fotogramas donde se desea aplicar la eliminación.

source: Click the Delete button.
es: Hacer clic en el botón **Borrar**.

source: To specify multiple indexes or frames, values have to be separated by a comma; to define a range of values, you can type the first and the last separated by a dash (e.g. 4-7 will refer to values 4, 5, 6 and 7).
es: Para especificar varios índices o fotogramas, los valores deben encontrarse separados por comas; para definir un rango de valores, es posible ingresar el primero y el último, separados por un guión (p.ej: 4-7 se referirá a los valores 4, 5, 6 y 7).

source: Using the Autopaint for Lines Option
es: Uso de la opción Pintar líneas automáticamente al rellenar

source: Toonz Raster levels may include colored lines coming from a color cleanup session, or from some applied match line levels (see :ref:`Processing Colored Lineart Drawings <processing_colored_lineart_drawings>` and :ref:`Using Match Lines <using_match_lines>` for details).
es: Es posible que los niveles de Imagen de Toonz incluyan líneas de color provenientes de una sesión de limpieza o de algunos niveles con líneas de coincidencia (ver :ref:`Procesamiento de dibujos con líneas coloreadas <processing_colored_lineart_drawings>` y :ref:`Uso de Líneas de coincidencia <using_match_lines>` para más detalles).

source: In most of the cases these colored lines are meant to set the outline of the body shadow, or body highlight, and for this reason usually they have to be painted with the same color of the shadow or highlight areas they help define.
es: En la mayoría de los casos, el propósito de estas líneas de color es definir el contorno de las sombras e iluminaciones en los objetos dibujados y es, por este motivo, que usualmente deberán terminar siendo pintadas con el mismo color de las sombras o las áreas iluminadas que ellas mismas ayudan a definir.

source: This task can be performed automatically by setting a special property for the color, so that when you paint an area defined totally or partially by a line whose color has this property, the line is automatically painted with the same color you use for the area.
es: Esta tarea puede ser realizada de forma automática activando una propiedad especial en el color, de tal manera que al pintar un área definida total o parcialmente por una línea cuyo color posea esta propiedad activada, esta línea será automáticamente pintada con el mismo color usado para rellenar el área.

source: **To set the autopaint property for a color:**
es: **Para definir la propiedad Pintar líneas automáticamente al rellenar para un color:**

source: Select the color in the palette.
es: Seleccionar el color en la paleta.

source: In the Style Editor select the Settings page and activate the **Autopaint for Lines** option.
es: En el Editor de estilos seleccionar la solapa Opciones y activar la opción **Pintar (líneas) automáticamente al rellenar**.

source: **To automatically paint lines when painting areas:**
es: **Para pintar automáticamente líneas al pintar áreas:**

source: Paint an area defined totally or partially by a line whose color has the **Autopaint for Lines** option activated: the line is automatically painted with the same color you use for the area.
es: Pintar un área definida total o parcialmente por una línea cuyo color tenga activada la opción **Pintar (líneas) automáticamente al rellenar**: la línea será automáticamente pintada con el mismo color usado para el área.

source: Using a Color Model
es: Uso de un Modelo de color

source: Color models, usually created for accurate color-referencing during a production, in the form of images or animation levels, can be used while painting animation levels.
es: Los Modelos de color, usualmente creados durante una producción como un método de obtener una referencia precisa de colores (en forma de imágenes o niveles de animación), pueden ser usados al pintar niveles de animación.

source: Any image or animation level can be used as a reference by loading it in the Color Model viewer. In case an animation level is loaded, you can select any frame as a reference at any moment; in this way you can also create color models made of several drawings, for example one drawing for the Front view of the character, and one for the Back view.
es: Es posible usar cualquier imagen o nivel de animación como referencia, cargándolo en el visor de **Modelo de color**. En caso de cargar un nivel de animación, es posible seleccionar cualquier fotograma como referencia en cualquier momento; de esta manera también es posible crear modelos de color compuestos de varios dibujos, por ejemplo un dibujo para la vista Frontal de un personaje y uno para la vista Trasera, o uno con colores para el día y otro para la noche.

source: When a color model is loaded for the current level, you can decide to load its palette, thus overwriting the current level palette, or to keep the current animation level palette.
es: Cuando un Modelo de color es cargado para el nivel seleccionado, es posible decidir si cargar su paleta, sobrescribiendo la original del nivel, o si mantener intacta la paleta original del nivel de animación.

source: If the color model is a Toonz Raster or Vector level (TLV or PLI file), it already comes with a palette, whose style names and page configuration will be preserved.
es: Si el Modelo de color fuera un nivel de Imagen de Toonz o Vectorial de Toonz (archivos TLV o PLI), ya contendrán una paleta, cuyos nombres de estilo y configuración de páginas será preservada.

source: If the color model is a full-color Raster image or animation level, the palette is automatically generated by extracting colors from the image, or the first image of the level. If the full-color image contains many shaded colors, the palette will be optimized to reduce the number of colors.
es: Si el Modelo de color fuera una imagen o un nivel de animación, la paleta se generará automáticamente mediante la extracción de colores de la imagen o del primer fotograma del nivel. Si la imagen contuviera muchos tonos de color, la paleta se optimizará para reducir la cantidad de colores.

source: Best results can be achieved by preparing models painted with flat colors and whose lines have no antialiasing.
es: Es posible alcanzar los mejores resultados al preparar modelos pintados usando colores plenos y cuyas líneas no contengan suavizado de bordes.

source: When a color model is loaded for a certain animation level, it is associated to that level and the related palette, and it's displayed in the Color Model viewer every time that level is selected.
es: Cuando un Modelo de color es cargado para un determinado nivel de animación, quedará asociado a ese nivel y a su correspondiente paleta, y será mostrado en el visor de **Modelo de color** cada vez que dicho nivel sea seleccionado.

source: A color model can be associated to palettes stored in the Studio Palette. In this way every time you assign a palette to an animation level retrieving it from the Studio Palette, its related color model will be automatically associated to the level (see :ref:`Using the Studio Palette <using_the_studio_palette>` for details).
es: Es posible asociar un modelo de color a las paletas almacenadas en la **Paleta de estudio**. De esta forma, cada vez que se asigne una paleta a un nivel de animación, desde la **Paleta de estudio**, su Modelo de color correspondiente será automáticamente asociado a ese nivel (ver :ref:`Uso de la Paleta de estudio <using_the_studio_palette>` para más detalles).

source: You can also use any drawing belonging to the animation level as a color model to be used on the fly, but in this case it will neither be associated to the level, nor to the palette saved in the Studio Palette.
es: También es posible usar cualquier dibujo perteneciente al mismo nivel de animación como Modelo de color, para ser usado en el momento, pero en este caso no quedará asociado al nivel, ni a su paleta, si fuera guardada como Paleta de estudio.

source: When the image is displayed in the Color Model viewer, you can use it not only as visual reference, but also for picking styles with no need to use the Palette or the Style Picker tool (|style_picker|). The color model can also be panned and zoomed in or out, by using standard shortcuts.
es: Cuando la imagen es mostrada en el visor de Modelo de color, es posible usarla, no sólo como una referencia visual, sino también para escoger estilos sin necesidad de usar la Paleta o la herramienta **Selector de estilos** (|style_picker|). El Modelo de color también puede ser desplazado y acercado/alejado, usando los atajos de teclado usuales.

source: **To load a color model:**
es: **Para cargar un modelo de color:**

source: Choose File → **Load Color Model...**, and load the Toonz level or the full color raster image you want to use as a reference.
es: Elegir Archivo → **Cargar modelo de color...** para cargar el nivel de Toonz (PLI o TLV) o la imagen que se desee usar como referencia.

source: **Right-click** in the Color Model viewer and choose **Load Color Model...** from the menu that opens.
es: Hacer **clic derecho** en el visor de Modelo de color y elegir **Cargar modelo de color...** en el menú.

source: Drag and drop the Toonz level or the full color raster image you want to use as reference to the Color Model viewer.
es: Arrastrar y soltar, el nivel de Toonz o la imagen que se desee usar como referencia, sobre el visor de Modelo de color.

source: Choose whether to overwrite current palette with the Color Model palette, or to keep the current animation level palette.
es: Elegir si sobrescribir la paleta actual con la del Modelo de color o si conservar la paleta actual del nivel de animación.

source: If you decide to keep the current animation level palette, the current level palette will be applied to the Color Model as well.
es: Si se decidiera mantener la paleta actual del nivel de animación, ésta también se aplicará al Modelo de color.

source: **To select a frame from the loaded color model level:**
es: **Para seleccionar un fotograma de un nivel cargado como modelo de color:**

source: Use the playback buttons.
es: Usar los botones de reproducción.

source: Drag the frame bar cursor.
es: Arrastrar la barra de fotogramas.

source: Type in the frame bar field the number of the frame you want to view.
es: Ingresar el número de fotograma que se desee visualizar en el campo a la izquierda de la barra de fotogramas.

source: **To pick styles from a color model:**
es: **Para escoger estilos desde un modelo de color:**
